var nlsMessages_en = {
    "en": {
        "HISTORY" :"Хронология",
        
        "ARTICLES" : "Товары",
        "BRAND" : "Торговая марка",
        "CATEGORY" : "Категория",
        
        "ERR_RESOLVING_SKU" : "Информация указана не полностью или выбранных товаров нет в наличии. Укажите значения всех атрибутов или измените сочетание значений.",
        "QUANTITY_INPUT_ERROR" : "Недопустимое значение в поле Количество. Введите положительное целое число и повторите операцию.",
        "QUANTITY_INPUTS_ERROR" : "Поля Количество содержат недопустимые значения или пусты. Введите положительные целые числа и повторите операцию.",
        "WISHLIST_ADDED" : "Товар успешно добавлен в список предпочтений",
        "ERROR_CONTRACT_EXPIRED_GOTO_ORDER" : "Выбранные элементы невозможно добавить в корзину, так как для некоторых элементов заказа контракты более недоступны. Выберите доступные контракты для элементов заказа.",
        "MYACCOUNT_SAVEDORDERLIST_EMPTY_ADD_TO_REQ_FAIL" : "Невозможно скопировать этот сохраненный заказ в список покупок, так как он пуст.  Добавьте один или несколько элементов в сохраненный заказ.",
        "SHOPCART_ADDED" : "Товар успешно добавлен в корзину.",
        "PRICE" : "Цена:",
        "SKU" : "Артикул:",
        "PQ_PURCHASE" : "Заказ:",
        "PQ_PRICE_X" : "{0} -",
        "PQ_PRICE_X_TO_Y" : "С {0} по {1} -",
        "PQ_PRICE_X_OR_MORE" : "{0} или больше -",
        
        "COMPARE_ITEM_EXISTS" : "Товар, выбранный для добавления в область сравнения, уже добавлен.",
        "COMPATE_MAX_ITEMS" : "Одновременно можно сравнивать не более четырех товаров.",
        "COMPAREZONE_ADDED" : "Товар успешно добавлено в область сравнения.",
        
        "GENERICERR_MAINTEXT" : "При обработке последнего запроса в магазине возникла неполадка. Повторите попытку. Если неполадка сохранится, обратитесь к {0} за помощью.",
        "GENERICERR_CONTACT_US" : "как с нами связаться",
        
        "MSC_ITEMS" : "Товаров: {0}",
        
        
        "DEFAULT_WISH_LIST_NAME" : "Список предпочтений",
        "LIST_CREATED" : "Список предпочтений успешно создан.",
        "LIST_EDITED" : "Список предпочтений успешно изменен.",
        "LIST_DELETED" : "Список предпочтений успешно удален.",
        "ITEM_ADDED" : "Товар добавлен в список предпочтений.",
        "ITEM_REMOVED" : "Товар удален из списка предпочтений.",
        "ERR_NAME_EMPTY" : "Введите имя списка предпочтений.",
        "ERR_NAME_TOOLONG" : "Слишком длинное имя списка предпочтений.",
        "ERR_NAME_SHOPPING_LIST" : "Имя Список предпочтений зарезервировано для списка предпочтений по умолчанию. Выберите другое имя.",
        "ERR_NAME_DUPLICATE" : "Список предпочтений с выбранным вами именем уже существует. Выберите другое имя.",
        "INVALID_NAME_SHOPPING_LIST" : "Имя списка предпочтений содержит недопустимые символы.  Укажите алфавитно-цифровое имя.",
        "WISHLIST_EMAIL_SENT" : "Электронное сообщение отправлено.",
        "WISHLIST_MISSINGNAME" : "Не заполнено поле Имя. Введите свое имя и повторите попытку.",
        "WISHLIST_MISSINGEMAIL" : "Не заполнено поле Адрес электронной почты. Введите адрес электронной почты получателя списка предпочтений и повторите попытку.",
        "WISHLIST_INVALIDEMAILFORMAT" : "Недопустимый формат адреса электронной почты.",
        "WISHLIST_EMPTY" : "Создайте список предпочтений перед отправкой электронного сообщения.",
        "WISHLIST_INVALIDSENDERNAME" : "Поле Имя содержит недопустимые символы. Введите свое имя и повторите попытку.",
            
        
        "INV_STATUS_RETRIEVAL_ERROR" : "Ошибка при получении состояния запасов. Повторите попытку позже. Если ошибка возникнет снова, обратитесь к администратору сайта.",
        "INV_ATTR_UNAVAILABLE" : "{0} - недоступно",
        
        
        "CONFIGURATION" : "Конфигурация",
        
        
        "QC_UPDATE_SUCCESS" : "Профайл быстрого оформления заказа успешно обновлен.",
        "MYACCOUNT_ACTION_PERFORMED" : "Действие успешно выполнено.",
        
        
        
        "ITEM_COMPONENT_QUANTITY_NAME" : "{0} x {1}",
        
        
        "ORDER_LINE_STATUS_S" : "Заказ отправлен",
        "ORDER_LINE_STATUS_G" : "Обработка заказа",
        "ORDER_LINE_STATUS_K" : "Возвращен связанным",
        "ORDER_LINE_STATUS_V" : "Частично отправлен",
        "ORDER_LINE_STATUS_X" : "Заказ отменен",
        
        
        "ERROR_FACET_PRICE_INVALID" : "Неправильный формат цены.",
        
        
        "ERROR_RecipientTooLong" : "В поле Получатель указано слишком длинное значение.",
        "ERROR_FirstNameTooLong" : "Указано слишком длинное имя.",
        "ERROR_LastNameTooLong" : "В поле Фамилия указано слишком длинное значение.",
        "ERROR_MiddleNameTooLong" : "В поле Отчество указано слишком длинное значение.",
        "ERROR_AddressTooLong" : "Указан слишком длинный адрес.",
        "ERROR_CityTooLong" : "В поле Город указано слишком длинное значение.",
        "ERROR_StateTooLong" : "В поле Область/район указано слишком длинное значение.",
        "ERROR_CountryTooLong" : "Указано слишком длинное название страны или региона.",
        "ERROR_ZipCodeTooLong" : "Указан слишком длинный почтовый индекс.",
        "ERROR_EmailTooLong" : "В поле Адрес электронной почты указано слишком длинное значение.",
        "ERROR_PhoneTooLong" : "В поле Номер телефона указано слишком длинное значение.",
        "ERROR_FaxTooLong" : "В поле Факс указано слишком длинное значение.",
        "ERROR_RecipientEmpty" : "Не заполнено поле Получатель.",
        "ERROR_LastNameEmpty" : "Не заполнено поле Фамилия.",
        "ERROR_MiddleNameEmpty" : "Поле Отчество не может быть пустым.",
        "ERROR_AddressEmpty" : "Не заполнено поле Улица.",
        "ERROR_CityEmpty" : "Не заполнено поле Город.",
        "ERROR_StateEmpty" : "Необходимо указать область.",
        "ERROR_CountryEmpty" : "Не заполнено поле Страна/регион.",
        "ERROR_ZipCodeEmpty" : "Не заполнено поле Почтовый индекс.",
        "ERROR_EmailEmpty" : "Не заполнено поле Адрес электронной почты.",
        "ERROR_FirstNameEmpty" : "Не заполнено поле Имя.",
        "ERROR_PhonenumberEmpty" : "Не заполнено поле Номер телефона.",
        "ERROR_PhoneEmpty" : "Не заполнено поле Номер телефона.",
        "ERROR_FaxEmpty" : "Необходимо указать номер факса.",
        "ERROR_INVALIDEMAILFORMAT" : "Неправильный формат адреса электронной почты.",
        "ERROR_INVALIDPHONE" : "Неправильный формат номера телефона.",
        "PWDREENTER_DO_NOT_MATCH" : "Введенные пароли не совпадают.",
        "ERROR_SpecifyYear" : "Не указан год. Не заполняйте никакие поля дня рождения, если вы не хотите сообщать эту информацию.",
        "ERROR_SpecifyMonth" : "Не указан месяц. Не заполняйте никакие поля дня рождения, если вы не хотите сообщать эту информацию.",
        "ERROR_SpecifyDate" : "Не указан день. Не заполняйте никакие поля дня рождения, если вы не хотите сообщать эту информацию.",
        "ERROR_InvalidDate1" : "Эта дата отсутствует в выбранном месяце.",
        "ERROR_InvalidDate2" : "Указан недопустимый день рождения.",
        "ERROR_DEFAULTADDRESS" : "Невозможно удалить адрес. Адресная книга должна содержать хотя бы один адрес.",
        "INVALID_EXPIRY_DATE" : "Недопустимая дата истечения срока действия.",
        "ERROR_LogonIdEmpty" : "Необходимо указать ИД пользователя.",
        "ERROR_PasswordEmpty" : "Необходимо указать пароль.",
        "ERROR_VerifyPasswordEmpty" : "Необходимо указать подтверждение пароля.",
        "AGE_WARNING_ALERT" : "Ваш возраст младше 13 лет. Перед продолжением ознакомьтесь с нашей стратегией конфиденциальности для детей.",
        "ERROR_DefaultOrgRegistration" : "'Организация по умолчанию' не является допустимым именем организации. Укажите другое имя.",
        
        
        "ERROR_OrgNameEmpty" : "Необходимо указать имя организации.",
        "ERROR_OrgNameTooLong" : "В поле названия организации указано слишком длинное значение.",
        "Logon_WaitingForApproval" : "Ваш запрос на регистрацию принят.  Ваша учетная запись еще не утверждена. Пока учетная запись не утверждена, вход в систему невозможен.",
        "Logon_RegistrationRequired" : "Гостевым пользователям предоставляются ограниченные возможности просмотра каталога. Для получения доступа ко всему магазину зарегистрируйтесь или войдите в систему.",
        "ERROR_OrganizationDescription" :"В поле описания организации указано слишком длинное значение.",
        "ERROR_BusinessCategoryTooLong" :"В поле бизнес-категории указано слишком длинное значение.",
        "ERROR_SelectOrganizationTypeEmpty" :"Выберите тип организации.",
        "ERROR_ParentOrgNameEmpty" :"Найдите и выберите допустимую родительскую организацию, на основе которой требуется создать новую организацию.",
        
        
        "ERROR_ADD2CART_BROWSE_ONLY" : "Невозможно добавить в корзину товар в режиме доступа только для просмотра.",
        
        
        "ERROR_SL_RESOLVED_SKU" : "Информация указана не полностью. Для каждого атрибута выберите значение.",
        "ERROR_SL_EMPTY_SL_NAME" : "Введите имя нового списка покупок.",
        "ERROR_SL_LIST_NOT_CHOSEN" : "Выберите список покупок.",
        "ERROR_GLOBALLOGIN_BUYER_SEARCH" : "Ошибка при выполнении поиска",
        "GLOBAL_LOGIN_NO_USERS_FOUND" : "Пользователи не найдены",
        
        "ORG_ROLES_UPDATED" : "Роли организации успешно изменены.",
        "ORG_ROLES_UPDATE_NO_CHNAGE" : "Роли организации не были изменены.",
        "APPROVAL_MEMBER_GROUP_UPDATED" : "Группы участников утверждения успешно изменены.",
        "ORG_ENTITY_CREATED_UPDATING_ROLES" : "Организация успешно создана. Выполняется обновление ролей организации.",
        "ORG_SUMMARY_UPDATED" : "Сведения об организации успешно изменены.",

        
        "CSR_NO_SEARCH_CRITERIA" : "Критерии поиска не введены. Введите по крайней мере один критерий поиска.",
        "CSR_SUCCESS_CUSTOMER_ACCOUNT_ACCESS" : "Доступ к учетной записи клиента получен успешно.",
        "SUCCESS_ORDER_UNLOCK" : "Заказ успешно разблокирован.",
        "SUCCESS_ORDER_LOCK" : "Заказ успешно заблокирован.",
        "SUCCESS_ORDER_TAKE_OVER" : "Блокировка успешно установлена.",
        "CUSTOMER_ACCOUNT_ENABLE_SUCCESS" : "Учетная запись клиента успешно включена.",
        "CUSTOMER_ACCOUNT_DISABLE_SUCCESS" : "Учетная запись клиента успешно выключена.",
        "DISABLE_CUSTOMER_ACCOUNT" : "Выключить учетную запись клиента",
        "ENABLE_CUSTOMER_ACCOUNT" : "Включить учетную запись клиента",
        "RESET_PASSWORD_SUCCESS" : "Сброс пароля клиента выполнен успешно.",
        "ORDER_CANCEL_SUCCESS" : "Заказ успешно отменен.",
        "CSR_SUCCESS_NEW_GUEST_USER_CREATION" : "Гостевой клиент успешно создан.",
        "CSR_SUCCESS_NEW_REGISTERED_USER_CREATION" : "Зарегистрированный клиент успешно создан.",
        "CSR_PASSWORD_EMPTY" : "Не заполнено поле пароля CSR.",
        "ERROR_RESET_PASSWORD_ACCESS_ACCOUNT_TO_RESET" : "Не удалось сбросить пароль для нового зарегистрированного клиента. Откройте учетную запись клиента для сброса пароля.",
        "PLEASE_SELECT" :"Пожалуйста, выберите",
        "CSR_SESSION_TERMINATE_WARNING_MESSAGE" : "Текущий сеанс для клиента \"{0}\" будет завершен. Нажмите кнопку Да для завершения сеанса или Нет для продолжения работы в текущем сеансе.",
        "GUEST" : "Гость",
        "CSR_PASSWORD_EMPTY_MESSAGE" : "Для продолжения введите пароль.",
        "_ERR_PASSWORD_FAILED" :"Введен неверный пароль. Повторите попытку.",
        "ORDERS_SEARCH_BILLING_OPTION" : "Информация для выставления счетов",
        "ORDERS_SEARCH_SHIPPING_OPTION" : "Информация о доставке",
        "LOCK_CUSTOMER_ORDER_CSR" : "Заблокировать заказ",
        "UNLOCK_CUSTOMER_ORDER_CSR" : "Разблокировать заказ",
        "ORDER_LOCKED_ERROR_MSG" :"Карта или заказ \"{0}\" заблокированы. Дополнительную информацию можно получить в сервисном представительстве",
        "ADD_COMMENT_MESSAGE" :"Щелкните здесь, чтобы добавить новый комментарий в заказ.",
        "COMMENT_LENGTH_OUT_OF_RANGE" : "Длина комментария не может превышать 3000 символов.",
        "EMPTY_COMMENT" : "Введите комментарий для добавления в заказ."
    }
};

var cldrData_en = [{
        "main": {
            "en": {
                "identity": {
                    "version": {
                        "_number": "$Revision: 12418 $",
                        "_cldrVersion": "29"
                    },
                    "language": "ru"
                },
                "dates": {
                    "calendars": {
                        "gregorian": {
                            "months": {
                                "format": {
                                    "abbreviated": {
                                        "1": "Январь",
                                        "2": "Февраль",
                                        "3": "Март",
                                        "4": "Апрель",
                                        "5": "Май",
                                        "6": "Июнь",
                                        "7": "Июль",
                                        "8": "Август",
                                        "9": "Сентябрь",
                                        "10": "Октябрь",
                                        "11": "Ноябрь",
                                        "12": "Декабрь"
                                    },
                                    "narrow": {
                                        "1": "Я",
                                        "2": "Ф",
                                        "3": "М",
                                        "4": "А",
                                        "5": "М",
                                        "6": "И",
                                        "7": "И",
                                        "8": "А",
                                        "9": "С",
                                        "10": "О",
                                        "11": "Н",
                                        "12": "Д"
                                    },
                                    "wide": {
                                        "1": "Январь",
                                        "2": "Февраль",
                                        "3": "Март",
                                        "4": "Апрель",
                                        "5": "Май",
                                        "6": "Июнь",
                                        "7": "Июль",
                                        "8": "Август",
                                        "9": "Сентябрь",
                                        "10": "Октябрь",
                                        "11": "Ноябрь",
                                        "12": "Декабрь"
                                    }
                                },
                                "stand-alone": {
                                    "abbreviated": {
                                        "1": "Январь",
                                        "2": "Февраль",
                                        "3": "Март",
                                        "4": "Апрель",
                                        "5": "Май",
                                        "6": "Июнь",
                                        "7": "Июль",
                                        "8": "Август",
                                        "9": "Сентябрь",
                                        "10": "Октябрь",
                                        "11": "Ноябрь",
                                        "12": "Декабрь"
                                    },
                                    "narrow": {
                                        "1": "Я",
                                        "2": "Ф",
                                        "3": "М",
                                        "4": "А",
                                        "5": "М",
                                        "6": "И",
                                        "7": "И",
                                        "8": "А",
                                        "9": "С",
                                        "10": "О",
                                        "11": "Н",
                                        "12": "Д"
                                    },
                                    "wide": {
                                        "1": "Январь",
                                        "2": "Февраль",
                                        "3": "Март",
                                        "4": "Апрель",
                                        "5": "Май",
                                        "6": "Июнь",
                                        "7": "Июль",
                                        "8": "Август",
                                        "9": "Сентябрь",
                                        "10": "Октябрь",
                                        "11": "Ноябрь",
                                        "12": "Декабрь"
                                    }
                                }
                            },
                            "days": {
                                "format": {
                                    "abbreviated": {
                                        "sun": "Вск",
                                        "mon": "Пнд",
                                        "tue": "Втр",
                                        "wed": "Срд",
                                        "thu": "Чтв",
                                        "fri": "Птн",
                                        "sat": "Сбт"
                                    },
                                    "narrow": {
                                        "sun": "В",
                                        "mon": "П",
                                        "tue": "В",
                                        "wed": "С",
                                        "thu": "Ч",
                                        "fri": "П",
                                        "sat": "С"
                                    },
                                    "short": {
                                        "sun": "вс",
                                        "mon": "пн",
                                        "tue": "вт",
                                        "wed": "ср",
                                        "thu": "чт",
                                        "fri": "пт",
                                        "sat": "сб"
                                    },
                                    "wide": {
                                        "sun": "Воскресенье",
                                        "mon": "Понедельник",
                                        "tue": "Вторник",
                                        "wed": "Среда",
                                        "thu": "Четверг",
                                        "fri": "Пятница",
                                        "sat": "Суббота"
                                    }
                                },
                                "stand-alone": {
                                    "abbreviated": {
                                        "sun": "Вск",
                                        "mon": "Пнд",
                                        "tue": "Втр",
                                        "wed": "Срд",
                                        "thu": "Чтв",
                                        "fri": "Птн",
                                        "sat": "Сбт"
                                    },
                                    "narrow": {
                                        "sun": "В",
                                        "mon": "П",
                                        "tue": "В",
                                        "wed": "С",
                                        "thu": "Ч",
                                        "fri": "П",
                                        "sat": "С"
                                    },
                                    "short": {
                                        "sun": "вс",
                                        "mon": "пн",
                                        "tue": "вт",
                                        "wed": "ср",
                                        "thu": "чт",
                                        "fri": "пт",
                                        "sat": "сб"
                                    },
                                    "wide": {
                                        "sun": "Воскресенье",
                                        "mon": "Понедельник",
                                        "tue": "Вторник",
                                        "wed": "Среда",
                                        "thu": "Четверг",
                                        "fri": "Пятница",
                                        "sat": "Суббота"
                                    }
                                }
                            },
                            "quarters": {
                                "format": {
                                    "abbreviated": {
                                        "1": "Кв1",
                                        "2": "Кв2",
                                        "3": "Кв3",
                                        "4": "Кв4"
                                    },
                                    "narrow": {
                                        "1": "1",
                                        "2": "2",
                                        "3": "3",
                                        "4": "4"
                                    },
                                    "wide": {
                                        "1": "1-й квартал",
                                        "2": "2-й квартал",
                                        "3": "3-й квартал",
                                        "4": "4-й квартал"
                                    }
                                },
                                "stand-alone": {
                                    "abbreviated": {
                                        "1": "Кв1",
                                        "2": "Кв2",
                                        "3": "Кв3",
                                        "4": "Кв4"
                                    },
                                    "narrow": {
                                        "1": "1",
                                        "2": "2",
                                        "3": "3",
                                        "4": "4"
                                    },
                                    "wide": {
                                        "1": "1-й квартал",
                                        "2": "2-й квартал",
                                        "3": "3-й квартал",
                                        "4": "4-й квартал"
                                    }
                                }
                            },
                            "dayPeriods": {
                                "format": {
                                    "abbreviated": {
                                        "midnight": "полночь",
                                        "am": "AM",
                                        "am-alt-variant": "am",
                                        "noon": "полдень",
                                        "pm": "PM",
                                        "pm-alt-variant": "pm",
                                        "morning1": "утром",
                                        "afternoon1": "днем",
                                        "evening1": "вечером",
                                        "night1": "ночью"
                                    },
                                    "narrow": {
                                        "midnight": "пн",
                                        "am": "a",
                                        "am-alt-variant": "am",
                                        "noon": "пд",
                                        "pm": "p",
                                        "pm-alt-variant": "pm",
                                        "morning1": "утром",
                                        "afternoon1": "днем",
                                        "evening1": "вечером",
                                        "night1": "ночью"
                                    },
                                    "wide": {
                                        "midnight": "полночь",
                                        "am": "AM",
                                        "am-alt-variant": "am",
                                        "noon": "полдень",
                                        "pm": "PM",
                                        "pm-alt-variant": "pm",
                                        "morning1": "утром",
                                        "afternoon1": "днем",
                                        "evening1": "вечером",
                                        "night1": "ночью"
                                    }
                                },
                                "stand-alone": {
                                    "abbreviated": {
                                        "midnight": "полночь",
                                        "am": "AM",
                                        "am-alt-variant": "am",
                                        "noon": "полдень",
                                        "pm": "PM",
                                        "pm-alt-variant": "pm",
                                        "morning1": "утром",
                                        "afternoon1": "днем",
                                        "evening1": "вечером",
                                        "night1": "ночью"
                                    },
                                    "narrow": {
                                        "midnight": "полночь",
                                        "am": "AM",
                                        "am-alt-variant": "am",
                                        "noon": "полдень",
                                        "pm": "PM",
                                        "pm-alt-variant": "pm",
                                        "morning1": "утром",
                                        "afternoon1": "днем",
                                        "evening1": "вечером",
                                        "night1": "ночью"
                                    },
                                    "wide": {
                                        "midnight": "полночь",
                                        "am": "AM",
                                        "am-alt-variant": "am",
                                        "noon": "полдень",
                                        "pm": "PM",
                                        "pm-alt-variant": "pm",
                                        "morning1": "утро",
                                        "afternoon1": "день",
                                        "evening1": "вечер",
                                        "night1": "ночь"
                                    }
                                }
                            },
                            "eras": {
                                "eraNames": {
                                    "0": "До Рождества Христова",
                                    "0-alt-variant": "До нашей эры",
                                    "1": "от Рождества Христова",
                                    "1-alt-variant": "нашей эры"
                                },
                                "eraAbbr": {
                                    "0": "до н.э.",
                                    "0-alt-variant": "до н.э.",
                                    "1": "н.э.",
                                    "1-alt-variant": "н.э."
                                },
                                "eraNarrow": {
                                    "0": "B",
                                    "0-alt-variant": "до н.э.",
                                    "1": "A",
                                    "1-alt-variant": "н.э."
                                }
                            },
                            "dateFormats": {
                                "full": "EEEE, ММММ д, г",
                                "long": "ММММ д, г",
                                "medium": "МММ д, г",
                                "short": "М/д/гг"
                            },
                            "timeFormats": {
                                "full": "ч:мм:сс a zzzz",
                                "long": "ч:мм:сс a z",
                                "medium": "ч:мм:сс a",
                                "short": "ч:мм a"
                            },
                            "dateTimeFormats": {
                                "full": "{1} 'в' {0}",
                                "long": "{1} 'в' {0}",
                                "medium": "{1}, {0}",
                                "short": "{1}, {0}",
                                "availableFormats": {
                                    "d": "д",
                                    "E": "ccc",
                                    "Ed": "д E",
                                    "Ehm": "E ч:мм a",
                                    "EHm": "E ЧЧ:мм",
                                    "Ehms": "E ч:мм:сс a",
                                    "EHms": "E ЧЧ:мм:сс",
                                    "Gy": "г G",
                                    "GyMMM": "МММ г G",
                                    "GyMMMd": "МММ д, г G",
                                    "GyMMMEd": "E, МММ д, г G",
                                    "h": "ч a",
                                    "H": "ЧЧ",
                                    "hm": "ч:мм a",
                                    "Hm": "ЧЧ:мм",
                                    "hms": "ч:мм:сс a",
                                    "Hms": "ЧЧ:мм:сс",
                                    "hmsv": "ч:мм:сс a v",
                                    "Hmsv": "ЧЧ:мм:сс v",
                                    "hmv": "ч:мм a v",
                                    "Hmv": "ЧЧ:мм v",
                                    "M": "L",
                                    "Md": "М/д",
                                    "MEd": "E, М/д",
                                    "MMM": "LLL",
                                    "MMMd": "МММ д",
                                    "MMMEd": "E, МММ д",
                                    "MMMMd": "ММММ д",
                                    "ms": "мм:сс",
                                    "y": "г",
                                    "yM": "М/г",
                                    "yMd": "М/д/г",
                                    "yMEd": "E, М/д/г",
                                    "yMMM": "МММ г",
                                    "yMMMd": "МММ д, г",
                                    "yMMMEd": "E, МММ д, г",
                                    "yMMMM": "ММММ г",
                                    "yQQQ": "QQQ г",
                                    "yQQQQ": "QQQQ г"
                                },
                                "appendItems": {
                                    "Day": "{0} ({2}: {1})",
                                    "Day-Of-Week": "{0} {1}",
                                    "Era": "{0} {1}",
                                    "Hour": "{0} ({2}: {1})",
                                    "Minute": "{0} ({2}: {1})",
                                    "Month": "{0} ({2}: {1})",
                                    "Quarter": "{0} ({2}: {1})",
                                    "Second": "{0} ({2}: {1})",
                                    "Timezone": "{0} {1}",
                                    "Week": "{0} ({2}: {1})",
                                    "Year": "{0} {1}"
                                },
                                "intervalFormats": {
                                    "intervalFormatFallback": "{0} – {1}",
                                    "d": {
                                        "d": "д – д"
                                    },
                                    "h": {
                                        "a": "ч a – ч a",
                                        "h": "ч – ч a"
                                    },
                                    "H": {
                                        "H": "ЧЧ – ЧЧ"
                                    },
                                    "hm": {
                                        "a": "ч:мм a – ч:мм a",
                                        "h": "ч:мм – ч:мм a",
                                        "m": "ч:мм – ч:мм a"
                                    },
                                    "Hm": {
                                        "H": "ЧЧ:мм – ЧЧ:мм",
                                        "m": "ЧЧ:мм – ЧЧ:мм"
                                    },
                                    "hmv": {
                                        "a": "ч:мм a – ч:мм a v",
                                        "h": "ч:мм – ч:мм a v",
                                        "m": "ч:мм – ч:мм a v"
                                    },
                                    "Hmv": {
                                        "H": "ЧЧ:мм – ЧЧ:мм v",
                                        "m": "ЧЧ:мм – ЧЧ:мм v"
                                    },
                                    "hv": {
                                        "a": "ч a – ч a v",
                                        "h": "ч – ч a v"
                                    },
                                    "Hv": {
                                        "H": "ЧЧ – ЧЧ v"
                                    },
                                    "M": {
                                        "M": "М – М"
                                    },
                                    "Md": {
                                        "d": "М/д – М/д",
                                        "M": "М/д – М/д"
                                    },
                                    "MEd": {
                                        "d": "E, М/д – E, М/д",
                                        "M": "E, М/д – E, М/д"
                                    },
                                    "MMM": {
                                        "M": "МММ – МММ"
                                    },
                                    "MMMd": {
                                        "d": "МММ д – д",
                                        "M": "МММ д – МММ д"
                                    },
                                    "MMMEd": {
                                        "d": "E, МММ д – E, МММ д",
                                        "M": "E, МММ д – E, МММ д"
                                    },
                                    "y": {
                                        "y": "г – г"
                                    },
                                    "yM": {
                                        "M": "М/г – М/г",
                                        "y": "М/г – М/г"
                                    },
                                    "yMd": {
                                        "d": "М/д/г – М/д/г",
                                        "M": "М/д/г – М/д/г",
                                        "y": "М/д/г – М/д/г"
                                    },
                                    "yMEd": {
                                        "d": "E, М/д/г – E, М/д/г",
                                        "M": "E, М/д/г – E, М/д/г",
                                        "y": "E, М/д/г – E, М/д/г"
                                    },
                                    "yMMM": {
                                        "M": "МММ – МММ г",
                                        "y": "МММ г – МММ г"
                                    },
                                    "yMMMd": {
                                        "d": "МММ д – д, г",
                                        "M": "МММ д – МММ д, г",
                                        "y": "МММ д, г – МММ д, г"
                                    },
                                    "yMMMEd": {
                                        "d": "E, МММ д – E, МММ д, г",
                                        "M": "E, МММ д – E, МММ д, г",
                                        "y": "E, МММ д, г – E, МММ д, г"
                                    },
                                    "yMMMM": {
                                        "M": "ММММ – ММММ г",
                                        "y": "ММММ г – ММММ г"
                                    }
                                }
                            }
                        }
                    }
                },
                "numbers": {
                    "defaultNumberingSystem": "latn",
                    "otherNumberingSystems": {
                        "native": "latn"
                    },
                    "minimumGroupingDigits": "1",
                    "symbols-numberSystem-latn": {
                        "decimal": ".",
                        "group": ",",
                        "list": ";",
                        "percentSign": "%",
                        "plusSign": "+",
                        "minusSign": "-",
                        "exponential": "E",
                        "superscriptingExponent": "×",
                        "perMille": "‰",
                        "infinity": "∞",
                        "nan": "NaN",
                        "timeSeparator": ":"
                    },
                    "decimalFormats-numberSystem-latn": {
                        "standard": "# ##0,###",
                        "long": {
                            "decimalFormat": {
                                "1000-count-one": "0 тысяча",
                                "1000-count-other": "0 тысяча",
                                "10000-count-one": "00 тысяча",
                                "10000-count-other": "00 тысяча",
                                "100000-count-one": "000 тысяча",
                                "100000-count-other": "000 тысяча",
                                "1000000-count-one": "0 миллион",
                                "1000000-count-other": "0 миллион",
                                "10000000-count-one": "00 миллион",
                                "10000000-count-other": "00 миллион",
                                "100000000-count-one": "000 миллион",
                                "100000000-count-other": "000 миллион",
                                "1000000000-count-one": "0 миллиард",
                                "1000000000-count-other": "0 миллиард",
                                "10000000000-count-one": "00 миллиард",
                                "10000000000-count-other": "00 миллиард",
                                "100000000000-count-one": "000 миллиард",
                                "100000000000-count-other": "000 миллиард",
                                "1000000000000-count-one": "0 триллион",
                                "1000000000000-count-other": "0 триллион",
                                "10000000000000-count-one": "00 триллион",
                                "10000000000000-count-other": "00 триллион",
                                "100000000000000-count-one": "000 триллион",
                                "100000000000000-count-other": "000 триллион"
                            }
                        },
                        "short": {
                            "decimalFormat": {
                                "1000-count-one": "0 К",
                                "1000-count-other": "0 К",
                                "10000-count-one": "00 К",
                                "10000-count-other": "00 К",
                                "100000-count-one": "000 К",
                                "100000-count-other": "000 К",
                                "1000000-count-one": "0 М",
                                "1000000-count-other": "0 М",
                                "10000000-count-one": "00 М",
                                "10000000-count-other": "00 М",
                                "100000000-count-one": "000 М",
                                "100000000-count-other": "000 М",
                                "1000000000-count-one": "0 Мд",
                                "1000000000-count-other": "0 Мд",
                                "10000000000-count-one": "00 Мд",
                                "10000000000-count-other": "00 Мд",
                                "100000000000-count-one": "000 Мд",
                                "100000000000-count-other": "000 Мд",
                                "1000000000000-count-one": "0 Т",
                                "1000000000000-count-other": "0 Т",
                                "10000000000000-count-one": "00 Т",
                                "10000000000000-count-other": "00 Т",
                                "100000000000000-count-one": "000 Т",
                                "100000000000000-count-other": "000 Т"
                            }
                        }
                    },
                    "scientificFormats-numberSystem-latn": {
                        "standard": "#E0"
                    },
                    "percentFormats-numberSystem-latn": {
                        "standard": "###0%"
                    },
                    "currencyFormats-numberSystem-latn": {
                        "currencySpacing": {
                            "beforeCurrency": {
                                "currencyMatch": "[:^S:]",
                                "surroundingMatch": "[:digit:]",
                                "insertBetween": " "
                            },
                            "afterCurrency": {
                                "currencyMatch": "[:^S:]",
                                "surroundingMatch": "[:digit:]",
                                "insertBetween": " "
                            }
                        },
                        "standard": "¤# ##0,00",
                        "accounting": "¤# ##0,00;(¤# ##0,00)",
                        "short": {
                            "standard": {
                                "1000-count-one": "¤0 К",
                                "1000-count-other": "¤0 К",
                                "10000-count-one": "¤00 К",
                                "10000-count-other": "¤00 К",
                                "100000-count-one": "¤000 К",
                                "100000-count-other": "¤000 К",
                                "1000000-count-one": "¤0 М",
                                "1000000-count-other": "¤0 М",
                                "10000000-count-one": "¤00 М",
                                "10000000-count-other": "¤00 М",
                                "100000000-count-one": "¤000 М",
                                "100000000-count-other": "¤000 М",
                                "1000000000-count-one": "¤0 Мд",
                                "1000000000-count-other": "¤0 Мд",
                                "10000000000-count-one": "¤00 Мд",
                                "10000000000-count-other": "¤00 Мд",
                                "100000000000-count-one": "¤000 Мд",
                                "100000000000-count-other": "¤000 Мд",
                                "1000000000000-count-one": "¤0 Т",
                                "1000000000000-count-other": "¤0 Т",
                                "10000000000000-count-one": "¤00 Т",
                                "10000000000000-count-other": "¤00 Т",
                                "100000000000000-count-one": "¤000 Т",
                                "100000000000000-count-other": "¤000 Т"
                            }
                        },
                        "unitPattern-count-one": "{0} {1}",
                        "unitPattern-count-other": "{0} {1}"
                    },
                    "miscPatterns-numberSystem-latn": {
                        "atLeast": "{0}+",
                        "range": "{0} – {1}"
                    },
                    "currencies": {
                        "ADP": {
                            "displayName": "андоррская песета",
                            "displayName-count-one": "андоррская песета",
                            "displayName-count-other": "андоррские песеты",
                            "symbol": "ADP"
                        },
                        "AED": {
                            "displayName": "дирхам Объединенных Арабских Эмиратов",
                            "displayName-count-one": "дирхам Объединенных Арабских Эмиратов",
                            "displayName-count-other": "дирхамы Объединенных Арабских Эмиратов",
                            "symbol": "AED"
                        },
                        "AFA": {
                            "displayName": "Афганский афгани (1927–2002)",
                            "displayName-count-one": "Афганский афгани (1927–2002)",
                            "displayName-count-other": "Афганские афгани (1927–2002)",
                            "symbol": "AFA"
                        },
                        "AFN": {
                            "displayName": "Афганский афгани",
                            "displayName-count-one": "Афганский афгани",
                            "displayName-count-other": "Афганские афгани",
                            "symbol": "AFN"
                        },
                        "ALK": {
                            "displayName": "Албанский лек (1946–1965)",
                            "displayName-count-one": "Албанский лек (1946–1965)",
                            "displayName-count-other": "Албанский лек (1946–1965)"
                        },
                        "ALL": {
                            "displayName": "албанский лек",
                            "displayName-count-one": "албанский лек",
                            "displayName-count-other": "албанские леки",
                            "symbol": "ВСЕ"
                        },
                        "AMD": {
                            "displayName": "армянский драм",
                            "displayName-count-one": "армянский драм",
                            "displayName-count-other": "армянский драмы",
                            "symbol": "AMD"
                        },
                        "ANG": {
                            "displayName": "нидерландский антильский гульден",
                            "displayName-count-one": "нидерландский антильский гульден",
                            "displayName-count-other": "нидерландские антильские гульдены",
                            "symbol": "ANG"
                        },
                        "AOA": {
                            "displayName": "Ангольская кванза",
                            "displayName-count-one": "Ангольская кванза",
                            "displayName-count-other": "Ангольские кванзы",
                            "symbol": "AOA",
                            "symbol-alt-narrow": "Kz"
                        },
                        "AOK": {
                            "displayName": "Ангольская кванза (1977–1991)",
                            "displayName-count-one": "Ангольская кванза (1977–1991)",
                            "displayName-count-other": "Ангольские кванзы (1977–1991)",
                            "symbol": "AOK"
                        },
                        "AON": {
                            "displayName": "Ангольская новая кванза (1990–2000)",
                            "displayName-count-one": "Ангольская новая кванза (1990–2000)",
                            "displayName-count-other": "Ангольские новые кванзы (1990–2000)",
                            "symbol": "AON"
                        },
                        "AOR": {
                            "displayName": "Ангольская скорректированная кванза (1995–1999)",
                            "displayName-count-one": "Ангольская скорректированная кванза (1995–1999)",
                            "displayName-count-other": "Ангольские скорректированные кванзы (1995–1999)",
                            "symbol": "AOR"
                        },
                        "ARA": {
                            "displayName": "Аргентинский аустраль",
                            "displayName-count-one": "Аргентинский аустраль",
                            "displayName-count-other": "Аргентинские аустрали",
                            "symbol": "ARA"
                        },
                        "ARL": {
                            "displayName": "Аргентинское песо лей (1970–1983)",
                            "displayName-count-one": "Аргентинское песо лей (1970–1983)",
                            "displayName-count-other": "Аргентинские песо лей (1970–1983)",
                            "symbol": "ARL"
                        },
                        "ARM": {
                            "displayName": "Аргентинское песо (1881–1970)",
                            "displayName-count-one": "Аргентинское песо (1881–1970)",
                            "displayName-count-other": "Аргентинские песо (1881–1970)",
                            "symbol": "ARM"
                        },
                        "ARP": {
                            "displayName": "Аргентинское песо (1983–1985)",
                            "displayName-count-one": "Аргентинское песо (1983–1985)",
                            "displayName-count-other": "Аргентинские песо (1983–1985)",
                            "symbol": "ARP"
                        },
                        "ARS": {
                            "displayName": "аргентинское песо",
                            "displayName-count-one": "аргентинское песо",
                            "displayName-count-other": "Аргентинские песо",
                            "symbol": "ARS",
                            "symbol-alt-narrow": "$"
                        },
                        "ATS": {
                            "displayName": "австрийский шиллинг",
                            "displayName-count-one": "австрийский шиллинг",
                            "displayName-count-other": "австрийские шиллинги",
                            "symbol": "ATS"
                        },
                        "AUD": {
                            "displayName": "австралийский доллар",
                            "displayName-count-one": "австралийский доллар",
                            "displayName-count-other": "австралийские доллары",
                            "symbol": "A$",
                            "symbol-alt-narrow": "$"
                        },
                        "AWG": {
                            "displayName": "Арубанский флорин",
                            "displayName-count-one": "Арубанский флорин",
                            "displayName-count-other": "Арубанские флорины",
                            "symbol": "AWG"
                        },
                        "AZM": {
                            "displayName": "Азербайджанский манат (1993–2006)",
                            "displayName-count-one": "Азербайджанский манат (1993–2006)",
                            "displayName-count-other": "Азербайджанские манаты (1993–2006)",
                            "symbol": "AZM"
                        },
                        "AZN": {
                            "displayName": "Азербайджанский манат",
                            "displayName-count-one": "Азербайджанский манат",
                            "displayName-count-other": "Азербайджанские манаты",
                            "symbol": "AZN"
                        },
                        "BAD": {
                            "displayName": "Динар Боснии и Герцеговины (1992–1994)",
                            "displayName-count-one": "Динар Боснии и Герцеговины (1992–1994)",
                            "displayName-count-other": "Динары Боснии и Герцеговины (1992–1994)",
                            "symbol": "BAD"
                        },
                        "BAM": {
                            "displayName": "Конвертируемая марка Боснии и Герцеговины",
                            "displayName-count-one": "Конвертируемая марка Боснии и Герцеговины",
                            "displayName-count-other": "Конвертируемые марки Боснии и Герцеговины",
                            "symbol": "BAM",
                            "symbol-alt-narrow": "KM"
                        },
                        "BAN": {
                            "displayName": "Новый динар Боснии и Герцеговины (1994–1997)",
                            "displayName-count-one": "Новый динар Боснии и Герцеговины (1994–1997)",
                            "displayName-count-other": "Новые динары Боснии и Герцеговины (1994–1997)",
                            "symbol": "BAN"
                        },
                        "BBD": {
                            "displayName": "Барбадосский доллар",
                            "displayName-count-one": "Барбадосский доллар",
                            "displayName-count-other": "Барбадосские доллары",
                            "symbol": "BBD",
                            "symbol-alt-narrow": "$"
                        },
                        "BDT": {
                            "displayName": "бангладешская така",
                            "displayName-count-one": "бангладешская така",
                            "displayName-count-other": "Бангладешские таки",
                            "symbol": "BDT",
                            "symbol-alt-narrow": "৳"
                        },
                        "BEC": {
                            "displayName": "Бельгийский франк (конвертируемый)",
                            "displayName-count-one": "Бельгийский франк (конвертируемый)",
                            "displayName-count-other": "Бельгийские франки (конвертируемые)",
                            "symbol": "BEC"
                        },
                        "BEF": {
                            "displayName": "бельгийский франк",
                            "displayName-count-one": "бельгийский франк",
                            "displayName-count-other": "бельгийские франки",
                            "symbol": "BEF"
                        },
                        "BEL": {
                            "displayName": "Бельгийский франк (финансовый)",
                            "displayName-count-one": "Бельгийский франк (финансовый)",
                            "displayName-count-other": "Бельгийские франки (финансовые)",
                            "symbol": "BEL"
                        },
                        "BGL": {
                            "displayName": "Болгарский старый лев",
                            "displayName-count-one": "Болгарский старый лев",
                            "displayName-count-other": "Болгарские старые лева",
                            "symbol": "BGL"
                        },
                        "BGM": {
                            "displayName": "Болгарский социалистический лев",
                            "displayName-count-one": "Болгарский социалистический лев",
                            "displayName-count-other": "Болгарские социалистические лева",
                            "symbol": "BGM"
                        },
                        "BGN": {
                            "displayName": "болгарский лев",
                            "displayName-count-one": "болгарский лев",
                            "displayName-count-other": "болгарские лева",
                            "symbol": "BGN"
                        },
                        "BGO": {
                            "displayName": "Болгарский лев (1879–1952)",
                            "displayName-count-one": "Болгарский лев (1879–1952)",
                            "displayName-count-other": "Болгарские лева (1879–1952)",
                            "symbol": "BGO"
                        },
                        "BHD": {
                            "displayName": "бахрейнский динар",
                            "displayName-count-one": "бахрейнский динар",
                            "displayName-count-other": "бахрейнские динары",
                            "symbol": "BHD"
                        },
                        "BIF": {
                            "displayName": "бурундийский франк",
                            "displayName-count-one": "бурундийский франк",
                            "displayName-count-other": "бурундийские франки",
                            "symbol": "BIF"
                        },
                        "BMD": {
                            "displayName": "Бермудский доллар",
                            "displayName-count-one": "Бермудский доллар",
                            "displayName-count-other": "Бермудские доллары",
                            "symbol": "BMD",
                            "symbol-alt-narrow": "$"
                        },
                        "BND": {
                            "displayName": "брунейский доллар",
                            "displayName-count-one": "брунейский доллар",
                            "displayName-count-other": "брунейские доллары",
                            "symbol": "BND",
                            "symbol-alt-narrow": "$"
                        },
                        "BOB": {
                            "displayName": "боливийский боливиано",
                            "displayName-count-one": "боливийский боливиано",
                            "displayName-count-other": "Боливийские боливиано",
                            "symbol": "BOB",
                            "symbol-alt-narrow": "Bs"
                        },
                        "BOL": {
                            "displayName": "Боливийский боливиано (1863–1963)",
                            "displayName-count-one": "Боливийский боливиано (1863–1963)",
                            "displayName-count-other": "Боливийские боливиано (1863–1963)",
                            "symbol": "BOL"
                        },
                        "BOP": {
                            "displayName": "Боливийский песо",
                            "displayName-count-one": "Боливийский песо",
                            "displayName-count-other": "Боливийские песо",
                            "symbol": "BOP"
                        },
                        "BOV": {
                            "displayName": "Боливийский мвдол",
                            "displayName-count-one": "Боливийский мвдол",
                            "displayName-count-other": "Боливийские мвдолы",
                            "symbol": "BOV"
                        },
                        "BRB": {
                            "displayName": "Бразильский новый крузейро (1967–1986)",
                            "displayName-count-one": "Бразильский новый крузейро (1967–1986)",
                            "displayName-count-other": "Бразильские новые крузейро (1967–1986)",
                            "symbol": "BRB"
                        },
                        "BRC": {
                            "displayName": "Бразильский крузадо (1986–1989)",
                            "displayName-count-one": "Бразильский крузадо (1986–1989)",
                            "displayName-count-other": "Бразильские крузадо (1986–1989)",
                            "symbol": "BRC"
                        },
                        "BRE": {
                            "displayName": "Бразильский крузейро (1990–1993)",
                            "displayName-count-one": "Бразильский крузейро (1990–1993)",
                            "displayName-count-other": "Бразильские крузейро (1990–1993)",
                            "symbol": "BRE"
                        },
                        "BRL": {
                            "displayName": "бразильский реал",
                            "displayName-count-one": "бразильский реал",
                            "displayName-count-other": "бразильские реалы",
                            "symbol": "R$",
                            "symbol-alt-narrow": "R$"
                        },
                        "BRN": {
                            "displayName": "Бразильский новый крузадо (1989–1990)",
                            "displayName-count-one": "Бразильский новый крузадо (1989–1990)",
                            "displayName-count-other": "Бразильские новые крузадо (1989–1990)",
                            "symbol": "BRN"
                        },
                        "BRR": {
                            "displayName": "Бразильский крузейро (1993–1994)",
                            "displayName-count-one": "Бразильский крузейро (1993–1994)",
                            "displayName-count-other": "Бразильские крузейро (1993–1994)",
                            "symbol": "BRR"
                        },
                        "BRZ": {
                            "displayName": "Бразильский крузейро (1942–1967)",
                            "displayName-count-one": "Бразильский крузейро (1942–1967)",
                            "displayName-count-other": "Бразильские крузейро (1942–1967)",
                            "symbol": "BRZ"
                        },
                        "BSD": {
                            "displayName": "багамский доллар",
                            "displayName-count-one": "багамский доллар",
                            "displayName-count-other": "багамские доллары",
                            "symbol": "BSD",
                            "symbol-alt-narrow": "$"
                        },
                        "BTN": {
                            "displayName": "Бутанский нгултрум",
                            "displayName-count-one": "Бутанский нгултрум",
                            "displayName-count-other": "Бутанские нгултрумы",
                            "symbol": "BTN"
                        },
                        "BUK": {
                            "displayName": "Бирманский кьят",
                            "displayName-count-one": "Бирманский кьят",
                            "displayName-count-other": "Бирманские кьяты",
                            "symbol": "BUK"
                        },
                        "BWP": {
                            "displayName": "Ботсванская пула",
                            "displayName-count-one": "Ботсванская пула",
                            "displayName-count-other": "Ботсванские пулы",
                            "symbol": "BWP",
                            "symbol-alt-narrow": "P"
                        },
                        "BYB": {
                            "displayName": "Белорусский новый рубль (1994–1999)",
                            "displayName-count-one": "Белорусский новый рубль (1994–1999)",
                            "displayName-count-other": "Белорусские новые рубли (1994–1999)",
                            "symbol": "BYB"
                        },
                        "BYR": {
                            "displayName": "Белорусский рубль",
                            "displayName-count-one": "Белорусский рубль",
                            "displayName-count-other": "Белорусские рубли",
                            "symbol": "BYR",
                            "symbol-alt-narrow": "р."
                        },
                        "BZD": {
                            "displayName": "белизский доллар",
                            "displayName-count-one": "белизский доллар",
                            "displayName-count-other": "белизские доллары",
                            "symbol": "BZD",
                            "symbol-alt-narrow": "$"
                        },
                        "CAD": {
                            "displayName": "канадский доллар",
                            "displayName-count-one": "канадский доллар",
                            "displayName-count-other": "канадские доллары",
                            "symbol": "CA$",
                            "symbol-alt-narrow": "$"
                        },
                        "CDF": {
                            "displayName": "конголезский франк",
                            "displayName-count-one": "конголезский франк",
                            "displayName-count-other": "конголезские франки",
                            "symbol": "CDF"
                        },
                        "CHE": {
                            "displayName": "WIR-евро",
                            "displayName-count-one": "WIR-евро",
                            "displayName-count-other": "WIR-евро",
                            "symbol": "CHE"
                        },
                        "CHF": {
                            "displayName": "швейцарский франк",
                            "displayName-count-one": "швейцарский франк",
                            "displayName-count-other": "швейцарские франки",
                            "symbol": "CHF"
                        },
                        "CHW": {
                            "displayName": "WIR-франк",
                            "displayName-count-one": "WIR-франк",
                            "displayName-count-other": "WIR-франки",
                            "symbol": "CHW"
                        },
                        "CLE": {
                            "displayName": "Чилийский эскудо",
                            "displayName-count-one": "Чилийский эскудо",
                            "displayName-count-other": "Чилийские эскудо",
                            "symbol": "CLE"
                        },
                        "CLF": {
                            "displayName": "Чилийская расчетная денежная единица (UF)",
                            "displayName-count-one": "Чилийская расчетная денежная единица (UF)",
                            "displayName-count-other": "Чилийская расчетная денежная единица (UF)",
                            "symbol": "CLF"
                        },
                        "CLP": {
                            "displayName": "чилийское песо",
                            "displayName-count-one": "чилийское песо",
                            "displayName-count-other": "чилийские песо",
                            "symbol": "CLP",
                            "symbol-alt-narrow": "$"
                        },
                        "CNX": {
                            "displayName": "Доллар Народного банка Китая",
                            "displayName-count-one": "Доллар Народного банка Китая",
                            "displayName-count-other": "Доллары Народного банка Китая"
                        },
                        "CNY": {
                            "displayName": "китайский юань",
                            "displayName-count-one": "китайский юань",
                            "displayName-count-other": "китайский юань",
                            "symbol": "CN¥",
                            "symbol-alt-narrow": "¥"
                        },
                        "COP": {
                            "displayName": "колумбийское песо",
                            "displayName-count-one": "колумбийское песо",
                            "displayName-count-other": "колумбийские песо",
                            "symbol": "COP",
                            "symbol-alt-narrow": "$"
                        },
                        "COU": {
                            "displayName": "Колумбийская единица реальной стоимости",
                            "displayName-count-one": "Колумбийская единица реальной стоимости",
                            "displayName-count-other": "Колумбийские единицы реальной стоимости",
                            "symbol": "COU"
                        },
                        "CRC": {
                            "displayName": "костариканский колон",
                            "displayName-count-one": "коста-риканский колон",
                            "displayName-count-other": "костариканский колон",
                            "symbol": "CRC",
                            "symbol-alt-narrow": "₡"
                        },
                        "CSD": {
                            "displayName": "Сербский динар (2002–2006)",
                            "displayName-count-one": "Сербский динар (2002–2006)",
                            "displayName-count-other": "Сербские динары (2002–2006)",
                            "symbol": "CSD"
                        },
                        "CSK": {
                            "displayName": "Чехословацкая старая крона",
                            "displayName-count-one": "Чехословацкая старая крона",
                            "displayName-count-other": "Чехословацкая старая крона",
                            "symbol": "CSK"
                        },
                        "CUC": {
                            "displayName": "Кубинское конвертируемое песо",
                            "displayName-count-one": "Кубинское конвертируемое песо",
                            "displayName-count-other": "Кубинские конвертируемые песо",
                            "symbol": "CUC",
                            "symbol-alt-narrow": "$"
                        },
                        "CUP": {
                            "displayName": "кубинское песо",
                            "displayName-count-one": "кубинское песо",
                            "displayName-count-other": "кубинские песо",
                            "symbol": "CUP",
                            "symbol-alt-narrow": "$"
                        },
                        "CVE": {
                            "displayName": "кабо-вердийский эскудо",
                            "displayName-count-one": "кабо-вердийский эскудо",
                            "displayName-count-other": "кабо-вердийские эскудо",
                            "symbol": "CVE"
                        },
                        "CYP": {
                            "displayName": "Кипрский фунт",
                            "displayName-count-one": "Кипрский фунт",
                            "displayName-count-other": "кипрские фунты",
                            "symbol": "CYP"
                        },
                        "CZK": {
                            "displayName": "чешская крона",
                            "displayName-count-one": "чешская крона",
                            "displayName-count-other": "чешские кроны",
                            "symbol": "CZK",
                            "symbol-alt-narrow": "Kč"
                        },
                        "DDM": {
                            "displayName": "марка ГДР",
                            "displayName-count-one": "марка ГДР",
                            "displayName-count-other": "марки ГДР",
                            "symbol": "DDM"
                        },
                        "DEM": {
                            "displayName": "немецкая марка",
                            "displayName-count-one": "немецкая марка",
                            "displayName-count-other": "немецкие марки",
                            "symbol": "DEM"
                        },
                        "DJF": {
                            "displayName": "джибутийский франк",
                            "displayName-count-one": "джибутийский франк",
                            "displayName-count-other": "джибутийские франки",
                            "symbol": "DJF"
                        },
                        "DKK": {
                            "displayName": "датская крона",
                            "displayName-count-one": "датская крона",
                            "displayName-count-other": "датские кроны",
                            "symbol": "DKK",
                            "symbol-alt-narrow": "kr"
                        },
                        "DOP": {
                            "displayName": "доминиканское песо",
                            "displayName-count-one": "доминиканское песо",
                            "displayName-count-other": "доминиканские песо",
                            "symbol": "DOP",
                            "symbol-alt-narrow": "$"
                        },
                        "DZD": {
                            "displayName": "алжирский динар",
                            "displayName-count-one": "алжирский динар",
                            "displayName-count-other": "алжирские динары",
                            "symbol": "DZD"
                        },
                        "ECS": {
                            "displayName": "эквадорский сукре",
                            "displayName-count-one": "эквадорский сукре",
                            "displayName-count-other": "эквадорские сукре",
                            "symbol": "ECS"
                        },
                        "ECV": {
                            "displayName": "Эквадорская единица постоянной стоимости",
                            "displayName-count-one": "Эквадорская единица постоянной стоимости",
                            "displayName-count-other": "Эквадорская единица постоянной стоимости",
                            "symbol": "ECV"
                        },
                        "EEK": {
                            "displayName": "эстонская крона",
                            "displayName-count-one": "эстонская крона",
                            "displayName-count-other": "эстонские кроны",
                            "symbol": "EEK"
                        },
                        "EGP": {
                            "displayName": "египетский фунт",
                            "displayName-count-one": "египетский фунт",
                            "displayName-count-other": "египетские фунты",
                            "symbol": "EGP",
                            "symbol-alt-narrow": "E£"
                        },
                        "ERN": {
                            "displayName": "эритрейская накфа",
                            "displayName-count-one": "эритрейская накфа",
                            "displayName-count-other": "эритрейские накфы",
                            "symbol": "ERN"
                        },
                        "ESA": {
                            "displayName": "испанская песета (счет A)",
                            "displayName-count-one": "испанская песета (счет A)",
                            "displayName-count-other": "испанские песеты (счет A)",
                            "symbol": "ESA"
                        },
                        "ESB": {
                            "displayName": "испанская песета (конвертируемая)",
                            "displayName-count-one": "испанская песета (конвертируемая)",
                            "displayName-count-other": "испанская песета (конвертируемая)",
                            "symbol": "ESB"
                        },
                        "ESP": {
                            "displayName": "испанская песета",
                            "displayName-count-one": "испанская песета",
                            "displayName-count-other": "испанские песеты",
                            "symbol": "ESP",
                            "symbol-alt-narrow": "₧"
                        },
                        "ETB": {
                            "displayName": "эфиопский быр",
                            "displayName-count-one": "эфиопский быр",
                            "displayName-count-other": "эфиопский быр",
                            "symbol": "ETB"
                        },
                        "EUR": {
                            "displayName": "евро",
                            "displayName-count-one": "евро",
                            "displayName-count-other": "евро",
                            "symbol": "&euro;",
                            "symbol-alt-narrow": "&euro;"
                        },
                        "FIM": {
                            "displayName": "финская марка",
                            "displayName-count-one": "финская марка",
                            "displayName-count-other": "финские марки",
                            "symbol": "FIM"
                        },
                        "FJD": {
                            "displayName": "Доллар Фиджи",
                            "displayName-count-one": "Доллар Фиджи",
                            "displayName-count-other": "Доллары Фиджи",
                            "symbol": "FJD",
                            "symbol-alt-narrow": "$"
                        },
                        "FKP": {
                            "displayName": "фунт Фолклендских островов",
                            "displayName-count-one": "фунт Фолклендских островов",
                            "displayName-count-other": "фунты Фолклендских островов",
                            "symbol": "FKP",
                            "symbol-alt-narrow": "£"
                        },
                        "FRF": {
                            "displayName": "французский франк",
                            "displayName-count-one": "французский франк",
                            "displayName-count-other": "французские франки",
                            "symbol": "FRF"
                        },
                        "GBP": {
                            "displayName": "британский фунт",
                            "displayName-count-one": "британский фунт",
                            "displayName-count-other": "британские фунты",
                            "symbol": "£",
                            "symbol-alt-narrow": "£"
                        },
                        "GEK": {
                            "displayName": "грузинский купон лари",
                            "displayName-count-one": "грузинский купон лари",
                            "displayName-count-other": "грузинский купон лари",
                            "symbol": "GEK"
                        },
                        "GEL": {
                            "displayName": "грузинский лари",
                            "displayName-count-one": "грузинский лари",
                            "displayName-count-other": "грузинские лари",
                            "symbol": "GEL",
                            "symbol-alt-narrow": "₾"
                        },
                        "GHC": {
                            "displayName": "Ганский седи (1979–2007)",
                            "displayName-count-one": "Ганский седи (1979–2007)",
                            "displayName-count-other": "Ганские седи (1979–2007)",
                            "symbol": "GHC"
                        },
                        "GHS": {
                            "displayName": "ганский седи",
                            "displayName-count-one": "ганский седи",
                            "displayName-count-other": "ганские седи",
                            "symbol": "GHS"
                        },
                        "GIP": {
                            "displayName": "гибралтарский фунт",
                            "displayName-count-one": "гибралтарский фунт",
                            "displayName-count-other": "гибралтарские фунты",
                            "symbol": "GIP",
                            "symbol-alt-narrow": "£"
                        },
                        "GMD": {
                            "displayName": "гамбийский даласи",
                            "displayName-count-one": "гамбийский даласи",
                            "displayName-count-other": "гамбийские даласи",
                            "symbol": "GMD"
                        },
                        "GNF": {
                            "displayName": "гвинейский франк",
                            "displayName-count-one": "гвинейский франк",
                            "displayName-count-other": "гвинейские франки",
                            "symbol": "GNF",
                            "symbol-alt-narrow": "FG"
                        },
                        "GNS": {
                            "displayName": "гвинейский сили",
                            "displayName-count-one": "гвинейский сили",
                            "displayName-count-other": "гвинейские сили",
                            "symbol": "GNS"
                        },
                        "GQE": {
                            "displayName": "экуэле Экваториальной Гвинеи",
                            "displayName-count-one": "экуэле Экваториальной Гвинеи",
                            "displayName-count-other": "экуэле Экваториальной Гвинеи",
                            "symbol": "GQE"
                        },
                        "GRD": {
                            "displayName": "греческая драхма",
                            "displayName-count-one": "греческая драхма",
                            "displayName-count-other": "греческие драхмы",
                            "symbol": "GRD"
                        },
                        "GTQ": {
                            "displayName": "гватемальский кетcаль",
                            "displayName-count-one": "гватемальский кетcаль",
                            "displayName-count-other": "гватемальские кетсали",
                            "symbol": "GTQ",
                            "symbol-alt-narrow": "Q"
                        },
                        "GWE": {
                            "displayName": "эскудо Португальской Гвинеи",
                            "displayName-count-one": "эскудо Португальской Гвинеи",
                            "displayName-count-other": "эскудо Португальской Гвинеи",
                            "symbol": "GWE"
                        },
                        "GWP": {
                            "displayName": "песо Гвинеи - Бисау",
                            "displayName-count-one": "песо Гвинеи - Бисау",
                            "displayName-count-other": "песо Гвинеи - Бисау",
                            "symbol": "GWP"
                        },
                        "GYD": {
                            "displayName": "гайанский доллар",
                            "displayName-count-one": "гайанский доллар",
                            "displayName-count-other": "гайанские доллары",
                            "symbol": "GYD",
                            "symbol-alt-narrow": "$"
                        },
                        "HKD": {
                            "displayName": "гонконгский доллар",
                            "displayName-count-one": "гонконгский доллар",
                            "displayName-count-other": "гонконгские доллары",
                            "symbol": "HK$",
                            "symbol-alt-narrow": "$"
                        },
                        "HNL": {
                            "displayName": "гондурасская лемпира",
                            "displayName-count-one": "гондурасская лемпира",
                            "displayName-count-other": "гондурасские лемпиры",
                            "symbol": "HNL",
                            "symbol-alt-narrow": "L"
                        },
                        "HRD": {
                            "displayName": "хорватский динар",
                            "displayName-count-one": "хорватский динар",
                            "displayName-count-other": "хорватские динары",
                            "symbol": "HRD"
                        },
                        "HRK": {
                            "displayName": "хорватская куна",
                            "displayName-count-one": "хорватская куна",
                            "displayName-count-other": "хорватские куны",
                            "symbol": "HRK",
                            "symbol-alt-narrow": "kn"
                        },
                        "HTG": {
                            "displayName": "гаитянский гурд",
                            "displayName-count-one": "гаитянский гурд",
                            "displayName-count-other": "гаитянский гурд",
                            "symbol": "HTG"
                        },
                        "HUF": {
                            "displayName": "венгерский форинт",
                            "displayName-count-one": "венгерский форинт",
                            "displayName-count-other": "венгерские форинты",
                            "symbol": "HUF",
                            "symbol-alt-narrow": "Ft"
                        },
                        "IDR": {
                            "displayName": "индонезийская рупия",
                            "displayName-count-one": "индонезийская рупия",
                            "displayName-count-other": "индонезийские рупии",
                            "symbol": "IDR",
                            "symbol-alt-narrow": "Rp"
                        },
                        "IEP": {
                            "displayName": "ирландский фунт",
                            "displayName-count-one": "ирландский фунт",
                            "displayName-count-other": "ирландские фунты",
                            "symbol": "IEP"
                        },
                        "ILP": {
                            "displayName": "израильская лира",
                            "displayName-count-one": "израильская лира",
                            "displayName-count-other": "израильские лиры",
                            "symbol": "ILP"
                        },
                        "ILR": {
                            "displayName": "израильский шекель (1980–1985)",
                            "displayName-count-one": "израильский шекель (1980–1985)",
                            "displayName-count-other": "израильские шекели (1980–1985)"
                        },
                        "ILS": {
                            "displayName": "израильский новый шекель",
                            "displayName-count-one": "израильский новый шекель",
                            "displayName-count-other": "израильские новые шекели",
                            "symbol": "₪",
                            "symbol-alt-narrow": "₪"
                        },
                        "INR": {
                            "displayName": "индийская рупия",
                            "displayName-count-one": "индийская рупия",
                            "displayName-count-other": "индийские рупии",
                            "symbol": "₹",
                            "symbol-alt-narrow": "₹"
                        },
                        "IQD": {
                            "displayName": "иракский динар",
                            "displayName-count-one": "иракский динар",
                            "displayName-count-other": "иракские динары",
                            "symbol": "IQD"
                        },
                        "IRR": {
                            "displayName": "иранский риал",
                            "displayName-count-one": "иранский риал",
                            "displayName-count-other": "иранские риалы",
                            "symbol": "IRR"
                        },
                        "ISJ": {
                            "displayName": "исландская крона (1918–1981)",
                            "displayName-count-one": "исландская крона (1918–1981)",
                            "displayName-count-other": "исландские кроны (1918–1981)"
                        },
                        "ISK": {
                            "displayName": "исландская крона",
                            "displayName-count-one": "исландская крона",
                            "displayName-count-other": "исландские кроны",
                            "symbol": "ISK",
                            "symbol-alt-narrow": "kr"
                        },
                        "ITL": {
                            "displayName": "итальянская лира",
                            "displayName-count-one": "итальянская лира",
                            "displayName-count-other": "итальянские лиры",
                            "symbol": "ITL"
                        },
                        "JMD": {
                            "displayName": "ямайский доллар",
                            "displayName-count-one": "ямайский доллар",
                            "displayName-count-other": "ямайские доллары",
                            "symbol": "JMD",
                            "symbol-alt-narrow": "$"
                        },
                        "JOD": {
                            "displayName": "иорданский динар",
                            "displayName-count-one": "иорданский динар",
                            "displayName-count-other": "иорданские динары",
                            "symbol": "JOD"
                        },
                        "JPY": {
                            "displayName": "японская иена",
                            "displayName-count-one": "японская иена",
                            "displayName-count-other": "японская иена",
                            "symbol": "¥",
                            "symbol-alt-narrow": "¥"
                        },
                        "KES": {
                            "displayName": "кенийский шиллинг",
                            "displayName-count-one": "кенийский шиллинг",
                            "displayName-count-other": "кенийские шиллинги",
                            "symbol": "KES"
                        },
                        "KGS": {
                            "displayName": "киргизский сом",
                            "displayName-count-one": "киргизский сом",
                            "displayName-count-other": "киргизские сомы",
                            "symbol": "KGS"
                        },
                        "KHR": {
                            "displayName": "камбоджийский риель",
                            "displayName-count-one": "камбоджийский риель",
                            "displayName-count-other": "камбоджийские риели",
                            "symbol": "KHR",
                            "symbol-alt-narrow": "៛"
                        },
                        "KMF": {
                            "displayName": "франк Комор",
                            "displayName-count-one": "франк Комор",
                            "displayName-count-other": "франки Комор",
                            "symbol": "KMF",
                            "symbol-alt-narrow": "CF"
                        },
                        "KPW": {
                            "displayName": "северокорейская вона",
                            "displayName-count-one": "северокорейская вона",
                            "displayName-count-other": "северокорейские воны",
                            "symbol": "KPW",
                            "symbol-alt-narrow": "₩"
                        },
                        "KRH": {
                            "displayName": "южнокорейский хван (1953–1962)",
                            "displayName-count-one": "южнокорейский хван (1953–1962)",
                            "displayName-count-other": "южнокорейский хван (1953–1962)",
                            "symbol": "KRH"
                        },
                        "KRO": {
                            "displayName": "южнокорейская вона (1945–1953)",
                            "displayName-count-one": "южнокорейская вона (1945–1953)",
                            "displayName-count-other": "южнокорейская вона (1945–1953)",
                            "symbol": "KRO"
                        },
                        "KRW": {
                            "displayName": "южнокорейская вона",
                            "displayName-count-one": "южнокорейская вона",
                            "displayName-count-other": "южнокорейская вона",
                            "symbol": "₩",
                            "symbol-alt-narrow": "₩"
                        },
                        "KWD": {
                            "displayName": "кувейтский динар",
                            "displayName-count-one": "кувейтский динар",
                            "displayName-count-other": "кувейтские динары",
                            "symbol": "KWD"
                        },
                        "KYD": {
                            "displayName": "доллар Каймановых островов",
                            "displayName-count-one": "доллар Каймановых островов",
                            "displayName-count-other": "доллары Каймановых островов",
                            "symbol": "KYD",
                            "symbol-alt-narrow": "$"
                        },
                        "KZT": {
                            "displayName": "казахстанский тенге",
                            "displayName-count-one": "казахстанский тенге",
                            "displayName-count-other": "казахстанские тенге",
                            "symbol": "KZT",
                            "symbol-alt-narrow": "₸"
                        },
                        "LAK": {
                            "displayName": "лаосский кип",
                            "displayName-count-one": "лаосский кип",
                            "displayName-count-other": "лаосские кипы",
                            "symbol": "LAK",
                            "symbol-alt-narrow": "₭"
                        },
                        "LBP": {
                            "displayName": "ливанский фунт",
                            "displayName-count-one": "ливанский фунт",
                            "displayName-count-other": "ливанские фунты",
                            "symbol": "LBP",
                            "symbol-alt-narrow": "L£"
                        },
                        "LKR": {
                            "displayName": "рупия Шри-Ланки",
                            "displayName-count-one": "рупия Шри-Ланки",
                            "displayName-count-other": "рупии Шри-Ланки",
                            "symbol": "LKR",
                            "symbol-alt-narrow": "Rs"
                        },
                        "LRD": {
                            "displayName": "либерийский доллар",
                            "displayName-count-one": "либерийский доллар",
                            "displayName-count-other": "либерийские доллары",
                            "symbol": "LRD",
                            "symbol-alt-narrow": "$"
                        },
                        "LSL": {
                            "displayName": "лесотский лоти",
                            "displayName-count-one": "лесотский лоти",
                            "displayName-count-other": "лесотские лоти",
                            "symbol": "LSL"
                        },
                        "LTL": {
                            "displayName": "литовский лит",
                            "displayName-count-one": "литовский лит",
                            "displayName-count-other": "литовские литы",
                            "symbol": "LTL",
                            "symbol-alt-narrow": "Lt"
                        },
                        "LTT": {
                            "displayName": "литовский талон",
                            "displayName-count-one": "литовский талон",
                            "displayName-count-other": "литовские талоны",
                            "symbol": "LTT"
                        },
                        "LUC": {
                            "displayName": "люксембургский конвертируемый франк",
                            "displayName-count-one": "люксембургский конвертируемый франк",
                            "displayName-count-other": "люксембургские конвертируемые франки",
                            "symbol": "LUC"
                        },
                        "LUF": {
                            "displayName": "люксембургский франк",
                            "displayName-count-one": "люксембургский франк",
                            "displayName-count-other": "люксембургские франки",
                            "symbol": "LUF"
                        },
                        "LUL": {
                            "displayName": "люксембургский финансовый франк",
                            "displayName-count-one": "люксембургский финансовый франк",
                            "displayName-count-other": "люксембургские финансовые франки",
                            "symbol": "LUL"
                        },
                        "LVL": {
                            "displayName": "латвийский лат",
                            "displayName-count-one": "латвийский лат",
                            "displayName-count-other": "латвийские латы",
                            "symbol": "LVL",
                            "symbol-alt-narrow": "Ls"
                        },
                        "LVR": {
                            "displayName": "латвийский рубль",
                            "displayName-count-one": "латвийский рубль",
                            "displayName-count-other": "латвийские рубли",
                            "symbol": "LVR"
                        },
                        "LYD": {
                            "displayName": "ливийский динар",
                            "displayName-count-one": "ливийский динар",
                            "displayName-count-other": "ливийские динары",
                            "symbol": "LYD"
                        },
                        "MAD": {
                            "displayName": "марокканский дирхам",
                            "displayName-count-one": "марокканский дирхам",
                            "displayName-count-other": "марокканские дирхемы",
                            "symbol": "MAD"
                        },
                        "MAF": {
                            "displayName": "марокканский франк",
                            "displayName-count-one": "марокканский франк",
                            "displayName-count-other": "марокканские франки",
                            "symbol": "MAF"
                        },
                        "MCF": {
                            "displayName": "монакский франк",
                            "displayName-count-one": "монакский франк",
                            "displayName-count-other": "монакские франки",
                            "symbol": "MCF"
                        },
                        "MDC": {
                            "displayName": "молдавский купон",
                            "displayName-count-one": "молдавский купон",
                            "displayName-count-other": "молдавские купоны",
                            "symbol": "MDC"
                        },
                        "MDL": {
                            "displayName": "молдавский лей",
                            "displayName-count-one": "молдавский лей",
                            "displayName-count-other": "молдавски леи",
                            "symbol": "MDL"
                        },
                        "MGA": {
                            "displayName": "малагасийский ариари",
                            "displayName-count-one": "малагасийский ариари",
                            "displayName-count-other": "малагасийские ариари",
                            "symbol": "MGA",
                            "symbol-alt-narrow": "Ar"
                        },
                        "MGF": {
                            "displayName": "малагасийский франк",
                            "displayName-count-one": "малагасийский франк",
                            "displayName-count-other": "малагасийские франки",
                            "symbol": "MGF"
                        },
                        "MKD": {
                            "displayName": "македонский динар",
                            "displayName-count-one": "македонский динар",
                            "displayName-count-other": "македонские динары",
                            "symbol": "MKD"
                        },
                        "MKN": {
                            "displayName": "македонский динар (1992–1993)",
                            "displayName-count-one": "македонский динар (1992–1993)",
                            "displayName-count-other": "македонские динары (1992–1993)",
                            "symbol": "MKN"
                        },
                        "MLF": {
                            "displayName": "малийский франк",
                            "displayName-count-one": "малийский франк",
                            "displayName-count-other": "малийские франки",
                            "symbol": "MLF"
                        },
                        "MMK": {
                            "displayName": "кьят Мьянмы",
                            "displayName-count-one": "кьят Мьянмы",
                            "displayName-count-other": "кьяты Мьянмы",
                            "symbol": "MMK",
                            "symbol-alt-narrow": "K"
                        },
                        "MNT": {
                            "displayName": "монгольский тугрик",
                            "displayName-count-one": "монгольский тугрик",
                            "displayName-count-other": "монгольские тугрики",
                            "symbol": "MNT",
                            "symbol-alt-narrow": "₮"
                        },
                        "MOP": {
                            "displayName": "Патака Макао",
                            "displayName-count-one": "Патака Макао",
                            "displayName-count-other": "патака Макао",
                            "symbol": "MOP"
                        },
                        "MRO": {
                            "displayName": "мавританская угия",
                            "displayName-count-one": "мавританская угия",
                            "displayName-count-other": "мавританские угии",
                            "symbol": "MRO"
                        },
                        "MTL": {
                            "displayName": "мальтийская лира",
                            "displayName-count-one": "мальтийская лира",
                            "displayName-count-other": "мальтийские лиры",
                            "symbol": "MTL"
                        },
                        "MTP": {
                            "displayName": "мальтийский фунт",
                            "displayName-count-one": "мальтийский фунт",
                            "displayName-count-other": "мальтийские фунты",
                            "symbol": "MTP"
                        },
                        "MUR": {
                            "displayName": "маврикийская рупия",
                            "displayName-count-one": "маврикийская рупия",
                            "displayName-count-other": "маврикийские рупии",
                            "symbol": "MUR",
                            "symbol-alt-narrow": "Rs"
                        },
                        "MVP": {
                            "displayName": "мальдивская рупия (1947–1981)",
                            "displayName-count-one": "мальдивская рупия (1947–1981)",
                            "displayName-count-other": "мальдивские рупии (1947–1981)"
                        },
                        "MVR": {
                            "displayName": "мальдивская руфия",
                            "displayName-count-one": "мальдивская руфия",
                            "displayName-count-other": "мальдивские руфии",
                            "symbol": "MVR"
                        },
                        "MWK": {
                            "displayName": "малавийская квача",
                            "displayName-count-one": "малавийская квача",
                            "displayName-count-other": "малавийские квачи",
                            "symbol": "MWK"
                        },
                        "MXN": {
                            "displayName": "мексиканское песо",
                            "displayName-count-one": "мексиканское песо",
                            "displayName-count-other": "мексиканские песо",
                            "symbol": "MX$",
                            "symbol-alt-narrow": "$"
                        },
                        "MXP": {
                            "displayName": "мексиканское серебряное песо (1861–1992)",
                            "displayName-count-one": "мексиканское серебряное песо (1861–1992)",
                            "displayName-count-other": "мексиканские серебряные песо (1861–1992)",
                            "symbol": "MXP"
                        },
                        "MXV": {
                            "displayName": "мексиканская инверсионная единица",
                            "displayName-count-one": "мексиканская инверсионная единица",
                            "displayName-count-other": "мексиканская инверсионная единица",
                            "symbol": "MXV"
                        },
                        "MYR": {
                            "displayName": "малайзийский ринггит",
                            "displayName-count-one": "малайзийский ринггит",
                            "displayName-count-other": "малайзийские ринггиты",
                            "symbol": "MYR",
                            "symbol-alt-narrow": "RM"
                        },
                        "MZE": {
                            "displayName": "мозамбикский эскудо",
                            "displayName-count-one": "мозамбикский эскудо",
                            "displayName-count-other": "мозамбикские эскудо",
                            "symbol": "MZE"
                        },
                        "MZM": {
                            "displayName": "мозамбикский метикал (1980–2006)",
                            "displayName-count-one": "мозамбикский метикал (1980–2006)",
                            "displayName-count-other": "мозамбикские метикалы (1980–2006)",
                            "symbol": "MZM"
                        },
                        "MZN": {
                            "displayName": "мозамбикский метикал",
                            "displayName-count-one": "мозамбикский метикал",
                            "displayName-count-other": "мозамбикские метикалы",
                            "symbol": "MZN"
                        },
                        "NAD": {
                            "displayName": "доллар Намибии",
                            "displayName-count-one": "доллар Намибии",
                            "displayName-count-other": "доллары Намибии",
                            "symbol": "NAD",
                            "symbol-alt-narrow": "$"
                        },
                        "NGN": {
                            "displayName": "нигерийская найра",
                            "displayName-count-one": "нигерийская найра",
                            "displayName-count-other": "нигерийские найры",
                            "symbol": "NGN",
                            "symbol-alt-narrow": "₦"
                        },
                        "NIC": {
                            "displayName": "никарагуанская кордоба (1988–1991)",
                            "displayName-count-one": "никарагуанская кордоба (1988–1991)",
                            "displayName-count-other": "никарагуанская кордоба (1988–1991)",
                            "symbol": "NIC"
                        },
                        "NIO": {
                            "displayName": "никарагуанская кордоба",
                            "displayName-count-one": "никарагуанская кордоба",
                            "displayName-count-other": "никарагуанская кордоба",
                            "symbol": "NIO",
                            "symbol-alt-narrow": "C$"
                        },
                        "NLG": {
                            "displayName": "нидерландский гульден",
                            "displayName-count-one": "нидерландский гульден",
                            "displayName-count-other": "нидерландские гульдены",
                            "symbol": "NLG"
                        },
                        "NOK": {
                            "displayName": "норвежская крона",
                            "displayName-count-one": "норвежская крона",
                            "displayName-count-other": "норвежские кроны",
                            "symbol": "NOK",
                            "symbol-alt-narrow": "kr"
                        },
                        "NPR": {
                            "displayName": "непальская рупия",
                            "displayName-count-one": "непальская рупия",
                            "displayName-count-other": "непальские рупии",
                            "symbol": "NPR",
                            "symbol-alt-narrow": "Rs"
                        },
                        "NZD": {
                            "displayName": "новозеландский доллар",
                            "displayName-count-one": "новозеландский доллар",
                            "displayName-count-other": "новозеландские доллары",
                            "symbol": "NZ$",
                            "symbol-alt-narrow": "$"
                        },
                        "OMR": {
                            "displayName": "оманский риал",
                            "displayName-count-one": "оманский риал",
                            "displayName-count-other": "оманские риалы",
                            "symbol": "OMR"
                        },
                        "PAB": {
                            "displayName": "панамский бальбоа",
                            "displayName-count-one": "панамский бальбоа",
                            "displayName-count-other": "панамские бальбоа",
                            "symbol": "PAB"
                        },
                        "PEI": {
                            "displayName": "перуанский инти",
                            "displayName-count-one": "перуанский инти",
                            "displayName-count-other": "перуанские инти",
                            "symbol": "PEI"
                        },
                        "PEN": {
                            "displayName": "перуанский новый соль",
                            "displayName-count-one": "перуанский новый соль",
                            "displayName-count-other": "перуанский новый соль",
                            "symbol": "PEN"
                        },
                        "PES": {
                            "displayName": "перуанский соль (1863–1965)",
                            "displayName-count-one": "перуанский соль (1863–1965)",
                            "displayName-count-other": "перуанский соль (1863–1965)",
                            "symbol": "PES"
                        },
                        "PGK": {
                            "displayName": "кина Папуа - Новая Гвинея",
                            "displayName-count-one": "кина Папуа - Новая Гвинея",
                            "displayName-count-other": "кина Папуа - Новая Гвинея",
                            "symbol": "PGK"
                        },
                        "PHP": {
                            "displayName": "филиппинский песо",
                            "displayName-count-one": "филиппинский песо",
                            "displayName-count-other": "филиппинские песо",
                            "symbol": "PHP",
                            "symbol-alt-narrow": "₱"
                        },
                        "PKR": {
                            "displayName": "пакистанская рупия",
                            "displayName-count-one": "пакистанская рупия",
                            "displayName-count-other": "пакистанские рупии",
                            "symbol": "PKR",
                            "symbol-alt-narrow": "Rs"
                        },
                        "PLN": {
                            "displayName": "польский злотый",
                            "displayName-count-one": "польский злотый",
                            "displayName-count-other": "польские злотые",
                            "symbol": "PLN",
                            "symbol-alt-narrow": "zł"
                        },
                        "PLZ": {
                            "displayName": "польский злотый (1950–1995)",
                            "displayName-count-one": "польский злотый (PLZ–1995)",
                            "displayName-count-other": "польские злотые (PLZ)",
                            "symbol": "PLZ"
                        },
                        "PTE": {
                            "displayName": "португальский эскудо",
                            "displayName-count-one": "португальский эскудо",
                            "displayName-count-other": "португальские эскудо",
                            "symbol": "PTE"
                        },
                        "PYG": {
                            "displayName": "парагвайский гуарани",
                            "displayName-count-one": "парагвайский гуарани",
                            "displayName-count-other": "парагвайские гуарани",
                            "symbol": "PYG",
                            "symbol-alt-narrow": "₲"
                        },
                        "QAR": {
                            "displayName": "катарский риал",
                            "displayName-count-one": "катарский риал",
                            "displayName-count-other": "катарские риалы",
                            "symbol": "QAR"
                        },
                        "RHD": {
                            "displayName": "родезийский доллар",
                            "displayName-count-one": "родезийский доллар",
                            "displayName-count-other": "родезийские доллары",
                            "symbol": "RHD"
                        },
                        "ROL": {
                            "displayName": "румынский лей (1952–2006)",
                            "displayName-count-one": "румынский лей (1952–2006)",
                            "displayName-count-other": "румынские леи (1952–2006)",
                            "symbol": "ROL"
                        },
                        "RON": {
                            "displayName": "румынский лей",
                            "displayName-count-one": "румынский лей",
                            "displayName-count-other": "румынские леи",
                            "symbol": "RON"
                        },
                        "RSD": {
                            "displayName": "сербский динар",
                            "displayName-count-one": "сербский динар",
                            "displayName-count-other": "сербские динары",
                            "symbol": "RSD"
                        },
                        "RUB": {
                            "displayName": "российский рубль",
                            "displayName-count-one": "российский рубль",
                            "displayName-count-other": "российские рубли",
                            "symbol": "RUB",
                            "symbol-alt-narrow": "₽"
                        },
                        "RUR": {
                            "displayName": "российский рубль (1991–1998)",
                            "displayName-count-one": "российский рубль (1991–1998)",
                            "displayName-count-other": "российские рубли (1991–1998)",
                            "symbol": "RUR",
                            "symbol-alt-narrow": "р."
                        },
                        "RWF": {
                            "displayName": "франк Руанды",
                            "displayName-count-one": "франк Руанды",
                            "displayName-count-other": "франки Руанды",
                            "symbol": "RWF",
                            "symbol-alt-narrow": "RF"
                        },
                        "SAR": {
                            "displayName": "саудовский риял",
                            "displayName-count-one": "саудовский риял",
                            "displayName-count-other": "саудовские риялы",
                            "symbol": "SAR"
                        },
                        "SBD": {
                            "displayName": "доллар Соломоновых островов",
                            "displayName-count-one": "доллар Соломоновых островов",
                            "displayName-count-other": "доллары Соломоновых островов",
                            "symbol": "SBD",
                            "symbol-alt-narrow": "$"
                        },
                        "SCR": {
                            "displayName": "сейшельская рупия",
                            "displayName-count-one": "сейшельская рупия",
                            "displayName-count-other": "сейшельские рупии",
                            "symbol": "SCR"
                        },
                        "SDD": {
                            "displayName": "суданский динар (1992–2007)",
                            "displayName-count-one": "суданский динар (1992–2007)",
                            "displayName-count-other": "суданские динары (1992–2007)",
                            "symbol": "SDD"
                        },
                        "SDG": {
                            "displayName": "суданский фунт",
                            "displayName-count-one": "суданский фунт",
                            "displayName-count-other": "суданские фунты",
                            "symbol": "SDG"
                        },
                        "SDP": {
                            "displayName": "суданский фунт (1957–1998)",
                            "displayName-count-one": "суданский фунт (1957–1998)",
                            "displayName-count-other": "суданские фунты (1957–1998)",
                            "symbol": "SDP"
                        },
                        "SEK": {
                            "displayName": "шведская крона",
                            "displayName-count-one": "шведская крона",
                            "displayName-count-other": "шведские кроны",
                            "symbol": "SEK",
                            "symbol-alt-narrow": "kr"
                        },
                        "SGD": {
                            "displayName": "сингапурский доллар",
                            "displayName-count-one": "сингапурский доллар",
                            "displayName-count-other": "сингапурские доллары",
                            "symbol": "SGD",
                            "symbol-alt-narrow": "$"
                        },
                        "SHP": {
                            "displayName": "фунт Святой Елены",
                            "displayName-count-one": "фунт Святой Елены",
                            "displayName-count-other": "фунты Святой Елены",
                            "symbol": "SHP",
                            "symbol-alt-narrow": "£"
                        },
                        "SIT": {
                            "displayName": "словенский толар",
                            "displayName-count-one": "словенский толар",
                            "displayName-count-other": "словенские толары",
                            "symbol": "SIT"
                        },
                        "SKK": {
                            "displayName": "словацкая крона",
                            "displayName-count-one": "словацкая крона",
                            "displayName-count-other": "словацкие кроны",
                            "symbol": "SKK"
                        },
                        "SLL": {
                            "displayName": "леоне Сьерра-Леоне",
                            "displayName-count-one": "леоне Сьерра-Леоне",
                            "displayName-count-other": "леоне Сьерра-Леоне",
                            "symbol": "SLL"
                        },
                        "SOS": {
                            "displayName": "сомалийский шиллинг",
                            "displayName-count-one": "сомалийский шиллинг",
                            "displayName-count-other": "сомалийские шиллинги",
                            "symbol": "SOS"
                        },
                        "SRD": {
                            "displayName": "суринамский доллар",
                            "displayName-count-one": "суринамский доллар",
                            "displayName-count-other": "суринамские доллары",
                            "symbol": "SRD",
                            "symbol-alt-narrow": "$"
                        },
                        "SRG": {
                            "displayName": "суринамский гульден",
                            "displayName-count-one": "суринамский гульден",
                            "displayName-count-other": "суринамские гульдены",
                            "symbol": "SRG"
                        },
                        "SSP": {
                            "displayName": "южносуданский фунт",
                            "displayName-count-one": "южносуданский фунт",
                            "displayName-count-other": "южносуданские фунты",
                            "symbol": "SSP",
                            "symbol-alt-narrow": "£"
                        },
                        "STD": {
                            "displayName": "добра Сан-Томе и Принсипи",
                            "displayName-count-one": "добра Сан-Томе и Принсипи",
                            "displayName-count-other": "добра Сан-Томе и Принсипи",
                            "symbol": "STD",
                            "symbol-alt-narrow": "Db"
                        },
                        "SUR": {
                            "displayName": "рубль СССР",
                            "displayName-count-one": "рубль СССР",
                            "displayName-count-other": "рубли СССР",
                            "symbol": "SUR"
                        },
                        "SVC": {
                            "displayName": "сальвадорский колон",
                            "displayName-count-one": "сальвадорский колон",
                            "displayName-count-other": "сальвадрские колоны",
                            "symbol": "SVC"
                        },
                        "SYP": {
                            "displayName": "сирийский фунт",
                            "displayName-count-one": "сирийский фунт",
                            "displayName-count-other": "сирийские фунты",
                            "symbol": "SYP",
                            "symbol-alt-narrow": "£"
                        },
                        "SZL": {
                            "displayName": "Свазилендский лилангени",
                            "displayName-count-one": "Свазилендский лилангени",
                            "displayName-count-other": "Свазилендские лилангени",
                            "symbol": "SZL"
                        },
                        "THB": {
                            "displayName": "тайский бат",
                            "displayName-count-one": "тайский бат",
                            "displayName-count-other": "тайский бат",
                            "symbol": "THB",
                            "symbol-alt-narrow": "฿"
                        },
                        "TJR": {
                            "displayName": "таджикский рубль",
                            "displayName-count-one": "таджикский рубль",
                            "displayName-count-other": "таджикские рубли",
                            "symbol": "TJR"
                        },
                        "TJS": {
                            "displayName": "таджикский сомони",
                            "displayName-count-one": "таджикский сомони",
                            "displayName-count-other": "таджикские сомони",
                            "symbol": "TJS"
                        },
                        "TMM": {
                            "displayName": "туркменский манат (1993–2009)",
                            "displayName-count-one": "туркменский манат (1993–2009)",
                            "displayName-count-other": "туркменские манаты (1993–2009)",
                            "symbol": "TMM"
                        },
                        "TMT": {
                            "displayName": "туркменский манат",
                            "displayName-count-one": "туркменский манат",
                            "displayName-count-other": "туркменские манаты",
                            "symbol": "TMT"
                        },
                        "TND": {
                            "displayName": "тунисский динар",
                            "displayName-count-one": "тунисский динар",
                            "displayName-count-other": "тунисские динары",
                            "symbol": "TND"
                        },
                        "TOP": {
                            "displayName": "паанга Тонга",
                            "displayName-count-one": "паанга Тонга",
                            "displayName-count-other": "паанга Тонга",
                            "symbol": "TOP",
                            "symbol-alt-narrow": "T$"
                        },
                        "TPE": {
                            "displayName": "тиморское эскудо",
                            "displayName-count-one": "тиморское эскудо",
                            "displayName-count-other": "тиморское эскудо",
                            "symbol": "TPE"
                        },
                        "TRL": {
                            "displayName": "турецкая лира (1922–2005)",
                            "displayName-count-one": "турецкая лира (1922–2005)",
                            "displayName-count-other": "турецкие лиры (1922–2005)",
                            "symbol": "TRL"
                        },
                        "TRY": {
                            "displayName": "турецкая лира",
                            "displayName-count-one": "турецкая лира",
                            "displayName-count-other": "турецкая лира",
                            "symbol": "TRY",
                            "symbol-alt-narrow": "₺",
                            "symbol-alt-variant": "TL"
                        },
                        "TTD": {
                            "displayName": "доллар Тринидада и Тобаго",
                            "displayName-count-one": "доллар Тринидада и Тобаго",
                            "displayName-count-other": "доллары Тринидада и Тобаго",
                            "symbol": "TTD",
                            "symbol-alt-narrow": "$"
                        },
                        "TWD": {
                            "displayName": "новый тайванский доллар",
                            "displayName-count-one": "новый тайванский доллар",
                            "displayName-count-other": "новые тайванские доллары",
                            "symbol": "NT$",
                            "symbol-alt-narrow": "$"
                        },
                        "TZS": {
                            "displayName": "танзанийский шиллинг",
                            "displayName-count-one": "танзанийский шиллинг",
                            "displayName-count-other": "танзанийские шиллинги",
                            "symbol": "TZS"
                        },
                        "UAH": {
                            "displayName": "украинская гривна",
                            "displayName-count-one": "украинская гривна",
                            "displayName-count-other": "украинские гривны",
                            "symbol": "UAH",
                            "symbol-alt-narrow": "₴"
                        },
                        "UAK": {
                            "displayName": "украинский карбованец",
                            "displayName-count-one": "украинский карбованец",
                            "displayName-count-other": "украинские карбованцы",
                            "symbol": "UAK"
                        },
                        "UGS": {
                            "displayName": "угандийский шиллинг (1966–1987)",
                            "displayName-count-one": "угандийский шиллинг (1966–1987)",
                            "displayName-count-other": "угандийские шиллинги (1966–1987)",
                            "symbol": "UGS"
                        },
                        "UGX": {
                            "displayName": "угандийский шиллинг",
                            "displayName-count-one": "угандийский шиллинг",
                            "displayName-count-other": "угандийские шиллинги",
                            "symbol": "UGX"
                        },
                        "USD": {
                            "displayName": "доллар США",
                            "displayName-count-one": "доллар США",
                            "displayName-count-other": "доллары США",
                            "symbol": "$",
                            "symbol-alt-narrow": "$"
                        },
                        "USN": {
                            "displayName": "доллар США (следующего дня)",
                            "displayName-count-one": "доллар США (следующего дня)",
                            "displayName-count-other": "доллары США (следующего дня)",
                            "symbol": "USN"
                        },
                        "USS": {
                            "displayName": "доллар США (того же дня)",
                            "displayName-count-one": "доллар США (того же дня)",
                            "displayName-count-other": "доллары США (того же дня)",
                            "symbol": "USS"
                        },
                        "UYI": {
                            "displayName": "уругвайское песо в индексированных единицах",
                            "displayName-count-one": "уругвайское песо в индексированных единицах",
                            "displayName-count-other": "уругвайские песо в индексированных единицах",
                            "symbol": "UYI"
                        },
                        "UYP": {
                            "displayName": "уругвайское песо (1975–1993)",
                            "displayName-count-one": "уругвайское песо (1975–1993)",
                            "displayName-count-other": "уругвайские песо (1975–1993)",
                            "symbol": "UYP"
                        },
                        "UYU": {
                            "displayName": "уругвайское песо",
                            "displayName-count-one": "уругвайское песо",
                            "displayName-count-other": "уругвайские песо",
                            "symbol": "UYU",
                            "symbol-alt-narrow": "$"
                        },
                        "UZS": {
                            "displayName": "узбекский сум",
                            "displayName-count-one": "узбекский сум",
                            "displayName-count-other": "узбекские сумы",
                            "symbol": "UZS"
                        },
                        "VEB": {
                            "displayName": "венесуэльский боливар (1871–2008)",
                            "displayName-count-one": "венесуэльский боливар (1871–2008)",
                            "displayName-count-other": "венесуэльские боливары (1871–2008)",
                            "symbol": "VEB"
                        },
                        "VEF": {
                            "displayName": "венесуэльский боливар",
                            "displayName-count-one": "венесуэльский боливар",
                            "displayName-count-other": "венесуэльские боливары",
                            "symbol": "VEF",
                            "symbol-alt-narrow": "Bs"
                        },
                        "VND": {
                            "displayName": "вьетнамский донг",
                            "displayName-count-one": "вьетнамский донг",
                            "displayName-count-other": "вьетнамские донги",
                            "symbol": "₫",
                            "symbol-alt-narrow": "₫"
                        },
                        "VNN": {
                            "displayName": "вьетнамский донг (1978–1985)",
                            "displayName-count-one": "вьетнамский донг (1978–1985)",
                            "displayName-count-other": "вьетнамские донги (1978–1985)",
                            "symbol": "VNN"
                        },
                        "VUV": {
                            "displayName": "вануатский вату",
                            "displayName-count-one": "вануатский вату",
                            "displayName-count-other": "венуатские вату",
                            "symbol": "VUV"
                        },
                        "WST": {
                            "displayName": "самоанская тала",
                            "displayName-count-one": "самоанская тала",
                            "displayName-count-other": "самоанская тала",
                            "symbol": "WST"
                        },
                        "XAF": {
                            "displayName": "Франк КФА BEAC",
                            "displayName-count-one": "Франк КФА BEAC",
                            "displayName-count-other": "Франки КФА BEAC",
                            "symbol": "FCFA"
                        },
                        "XAG": {
                            "displayName": "Серебристый",
                            "displayName-count-one": "серебро - тройская унция",
                            "displayName-count-other": "серебро - тройская унция",
                            "symbol": "XAG"
                        },
                        "XAU": {
                            "displayName": "Золотой",
                            "displayName-count-one": "золото - тройская унция",
                            "displayName-count-other": "золото - тройская унция",
                            "symbol": "XAU"
                        },
                        "XBA": {
                            "displayName": "Европейская составная единица EURCO",
                            "displayName-count-one": "Европейская составная единица EURCO",
                            "displayName-count-other": "Европейская составная единица EURCO",
                            "symbol": "XBA"
                        },
                        "XBB": {
                            "displayName": "Европейская валютная единица EMU-6",
                            "displayName-count-one": "Европейская валютная единица EMU-6",
                            "displayName-count-other": "Европейская валютная единица EMU-6",
                            "symbol": "XBB"
                        },
                        "XBC": {
                            "displayName": "Европейская расчётная единица (XBC)",
                            "displayName-count-one": "Европейская расчётная единица (XBC)",
                            "displayName-count-other": "Европейская расчётная единица (XBC)",
                            "symbol": "XBC"
                        },
                        "XBD": {
                            "displayName": "Европейская расчётная единица (XBD)",
                            "displayName-count-one": "Европейская расчётная единица (XBD)",
                            "displayName-count-other": "Европейская расчётная единица (XBD)",
                            "symbol": "XBD"
                        },
                        "XCD": {
                            "displayName": "восточно-карибский доллар",
                            "displayName-count-one": "восточно-карибский доллар",
                            "displayName-count-other": "восточно-карибские доллары",
                            "symbol": "EC$",
                            "symbol-alt-narrow": "$"
                        },
                        "XDR": {
                            "displayName": "СДР (специальные права заимствования)",
                            "displayName-count-one": "СДР (специальные права заимствования)",
                            "displayName-count-other": "СДР (специальные права заимствования)",
                            "symbol": "XDR"
                        },
                        "XEU": {
                            "displayName": "европейская денежная единица",
                            "displayName-count-one": "европейская денежная единица",
                            "displayName-count-other": "европейская денежная единица",
                            "symbol": "XEU"
                        },
                        "XFO": {
                            "displayName": "французский золотой франк",
                            "displayName-count-one": "французский золотой франк",
                            "displayName-count-other": "французские золотые франки",
                            "symbol": "XFO"
                        },
                        "XFU": {
                            "displayName": "франк UIC",
                            "displayName-count-one": "франк UIC",
                            "displayName-count-other": "франки UIC",
                            "symbol": "XFU"
                        },
                        "XOF": {
                            "displayName": "Франк КФА BCEAO",
                            "displayName-count-one": "Франк КФА BCEAO",
                            "displayName-count-other": "Франки КФА BCEAO",
                            "symbol": "CFA"
                        },
                        "XPD": {
                            "displayName": "палладий",
                            "displayName-count-one": "палладий - тройская унция",
                            "displayName-count-other": "палладий - тройская унция",
                            "symbol": "XPD"
                        },
                        "XPF": {
                            "displayName": "франк CFP",
                            "displayName-count-one": "франк CFP",
                            "displayName-count-other": "франки CFP",
                            "symbol": "CFPF"
                        },
                        "XPT": {
                            "displayName": "платина",
                            "displayName-count-one": "платина - тройская унция",
                            "displayName-count-other": "платина - тройская унция",
                            "symbol": "XPT"
                        },
                        "XRE": {
                            "displayName": "фунты RINET",
                            "displayName-count-one": "фунты RINET",
                            "displayName-count-other": "фунты RINET",
                            "symbol": "XRE"
                        },
                        "XSU": {
                            "displayName": "сукре",
                            "displayName-count-one": "сукре",
                            "displayName-count-other": "сукре",
                            "symbol": "XSU"
                        },
                        "XTS": {
                            "displayName": "тестовый код",
                            "displayName-count-one": "тестовый код",
                            "displayName-count-other": "тестовый код",
                            "symbol": "XTS"
                        },
                        "XUA": {
                            "displayName": "расчетная единица ADB",
                            "displayName-count-one": "расчетная единица ADB",
                            "displayName-count-other": "расчетные единицы ADB",
                            "symbol": "XUA"
                        },
                        "XXX": {
                            "displayName": "неизвестная денежная единица",
                            "displayName-count-one": "(неизвестная денежная единица)",
                            "displayName-count-other": "(неизвестная денежная единица)",
                            "symbol": "XXX"
                        },
                        "YDD": {
                            "displayName": "йеменский динар",
                            "displayName-count-one": "йеменский динар",
                            "displayName-count-other": "йеменские динары",
                            "symbol": "YDD"
                        },
                        "YER": {
                            "displayName": "йеменский риал",
                            "displayName-count-one": "йеменский риал",
                            "displayName-count-other": "йеменские риалы",
                            "symbol": "YER"
                        },
                        "YUD": {
                            "displayName": "югославский динар (1966–1990)",
                            "displayName-count-one": "югославский динар (1966–1990)",
                            "displayName-count-other": "югославские динары (1966–1990)",
                            "symbol": "YUD"
                        },
                        "YUM": {
                            "displayName": "югославский новый динар (1994–2002)",
                            "displayName-count-one": "югославский новый динар (1994–2002)",
                            "displayName-count-other": "югославские новые динары (1994–2002)",
                            "symbol": "YUM"
                        },
                        "YUN": {
                            "displayName": "югославский конвертируемый динар (1990–1992)",
                            "displayName-count-one": "югославский конвертируемый динар (1990–1992)",
                            "displayName-count-other": "югославские конвертируемые динары (1990–1992)",
                            "symbol": "YUN"
                        },
                        "YUR": {
                            "displayName": "югославский реформированный динар (1992–1993)",
                            "displayName-count-one": "югославский реформированный динар (1992–1993)",
                            "displayName-count-other": "югославские реформированные динары (1992–1993)",
                            "symbol": "YUR"
                        },
                        "ZAL": {
                            "displayName": "южноафриканский финансовый рэнд",
                            "displayName-count-one": "южноафриканский финансовый рэнд",
                            "displayName-count-other": "южноафриканские финансовые рэнды",
                            "symbol": "ZAL"
                        },
                        "ZAR": {
                            "displayName": "южноафриканский рэнд",
                            "displayName-count-one": "южноафриканский рэнд",
                            "displayName-count-other": "южноафриканские рэнды",
                            "symbol": "ZAR",
                            "symbol-alt-narrow": "R"
                        },
                        "ZMK": {
                            "displayName": "замбийская квача (1968–2012)",
                            "displayName-count-one": "замбийская квача (1968–2012)",
                            "displayName-count-other": "замбийские квачи (1968–2012)",
                            "symbol": "ZMK"
                        },
                        "ZMW": {
                            "displayName": "замбийская квача",
                            "displayName-count-one": "замбийская квача",
                            "displayName-count-other": "замбийские квачи",
                            "symbol": "ZMW",
                            "symbol-alt-narrow": "ZK"
                        },
                        "ZRN": {
                            "displayName": "заирский новый заир (1993–1998)",
                            "displayName-count-one": "заирский новый заир (1993–1998)",
                            "displayName-count-other": "заирские новые заиры (1993–1998)",
                            "symbol": "ZRN"
                        },
                        "ZRZ": {
                            "displayName": "заирский заир (1971–1993)",
                            "displayName-count-one": "заирский заир (1971–1993)",
                            "displayName-count-other": "заирские заиры (1971–1993)",
                            "symbol": "ZRZ"
                        },
                        "ZWD": {
                            "displayName": "зимбабвийский доллар (1980–2008)",
                            "displayName-count-one": "зимбабвийский доллар (1980–2008)",
                            "displayName-count-other": "зимбабвийские доллары (1980–2008)",
                            "symbol": "ZWD"
                        },
                        "ZWL": {
                            "displayName": "зимбабвийский доллар (2009)",
                            "displayName-count-one": "зимбабвийский доллар (2009)",
                            "displayName-count-other": "зимбабвийские доллары (2009)",
                            "symbol": "ZWL"
                        },
                        "ZWR": {
                            "displayName": "зимбабвийский доллар (2008)",
                            "displayName-count-one": "зимбабвийский доллар (2008)",
                            "displayName-count-other": "зимбабвийские доллары (2008)",
                            "symbol": "ZWR"
                        }
                    }
                }
            }
        }
    },
    {
        "supplemental": {
            "version": {
                "_number": "$Revision: 12447 $",
                "_unicodeVersion": "8.0.0",
                "_cldrVersion": "29"
            },
            "likelySubtags": {
                "en": "en-Latn-US"
            },
            "plurals-type-cardinal": {
                "en": {
                    "pluralRule-count-one": "i = 1 and v = 0 @integer 1",
                    "pluralRule-count-other": " @integer 0, 2~16, 100, 1000, 10000, 100000, 1000000, … @decimal 0.0~1.5, 10.0, 100.0, 1000.0, 10000.0, 100000.0, 1000000.0, …"
                }
            },
            "currencyData": {
                "fractions": {
                    "ADP": {
                        "_rounding": "0",
                        "_digits": "0"
                    },
                    "AFN": {
                        "_rounding": "0",
                        "_digits": "0"
                    },
                    "ALL": {
                        "_rounding": "0",
                        "_digits": "0"
                    },
                    "AMD": {
                        "_rounding": "0",
                        "_digits": "0"
                    },
                    "BHD": {
                        "_rounding": "0",
                        "_digits": "3"
                    },
                    "BIF": {
                        "_rounding": "0",
                        "_digits": "0"
                    },
                    "BYR": {
                        "_rounding": "0",
                        "_digits": "0"
                    },
                    "CAD": {
                        "_rounding": "0",
                        "_digits": "2",
                        "_cashRounding": "5"
                    },
                    "CHF": {
                        "_rounding": "0",
                        "_digits": "2",
                        "_cashRounding": "5"
                    },
                    "CLF": {
                        "_rounding": "0",
                        "_digits": "4"
                    },
                    "CLP": {
                        "_rounding": "0",
                        "_digits": "0"
                    },
                    "COP": {
                        "_rounding": "0",
                        "_digits": "0"
                    },
                    "CRC": {
                        "_rounding": "0",
                        "_digits": "0"
                    },
                    "CZK": {
                        "_rounding": "0",
                        "_digits": "2",
                        "_cashRounding": "0",
                        "_cashDigits": "0"
                    },
                    "DEFAULT": {
                        "_rounding": "0",
                        "_digits": "2"
                    },
                    "DJF": {
                        "_rounding": "0",
                        "_digits": "0"
                    },
                    "ESP": {
                        "_rounding": "0",
                        "_digits": "0"
                    },
                    "GNF": {
                        "_rounding": "0",
                        "_digits": "0"
                    },
                    "GYD": {
                        "_rounding": "0",
                        "_digits": "0"
                    },
                    "HUF": {
                        "_rounding": "0",
                        "_digits": "2",
                        "_cashRounding": "0",
                        "_cashDigits": "0"
                    },
                    "IDR": {
                        "_rounding": "0",
                        "_digits": "0"
                    },
                    "IQD": {
                        "_rounding": "0",
                        "_digits": "0"
                    },
                    "IRR": {
                        "_rounding": "0",
                        "_digits": "0"
                    },
                    "ISK": {
                        "_rounding": "0",
                        "_digits": "0"
                    },
                    "ITL": {
                        "_rounding": "0",
                        "_digits": "0"
                    },
                    "JOD": {
                        "_rounding": "0",
                        "_digits": "3"
                    },
                    "JPY": {
                        "_rounding": "0",
                        "_digits": "0"
                    },
                    "KMF": {
                        "_rounding": "0",
                        "_digits": "0"
                    },
                    "KPW": {
                        "_rounding": "0",
                        "_digits": "0"
                    },
                    "KRW": {
                        "_rounding": "0",
                        "_digits": "0"
                    },
                    "KWD": {
                        "_rounding": "0",
                        "_digits": "3"
                    },
                    "LAK": {
                        "_rounding": "0",
                        "_digits": "0"
                    },
                    "LBP": {
                        "_rounding": "0",
                        "_digits": "0"
                    },
                    "LUF": {
                        "_rounding": "0",
                        "_digits": "0"
                    },
                    "LYD": {
                        "_rounding": "0",
                        "_digits": "3"
                    },
                    "MGA": {
                        "_rounding": "0",
                        "_digits": "0"
                    },
                    "MGF": {
                        "_rounding": "0",
                        "_digits": "0"
                    },
                    "MMK": {
                        "_rounding": "0",
                        "_digits": "0"
                    },
                    "MNT": {
                        "_rounding": "0",
                        "_digits": "0"
                    },
                    "MRO": {
                        "_rounding": "0",
                        "_digits": "0"
                    },
                    "MUR": {
                        "_rounding": "0",
                        "_digits": "0"
                    },
                    "OMR": {
                        "_rounding": "0",
                        "_digits": "3"
                    },
                    "PKR": {
                        "_rounding": "0",
                        "_digits": "0"
                    },
                    "PYG": {
                        "_rounding": "0",
                        "_digits": "0"
                    },
                    "RSD": {
                        "_rounding": "0",
                        "_digits": "0"
                    },
                    "RWF": {
                        "_rounding": "0",
                        "_digits": "0"
                    },
                    "SLL": {
                        "_rounding": "0",
                        "_digits": "0"
                    },
                    "SOS": {
                        "_rounding": "0",
                        "_digits": "0"
                    },
                    "STD": {
                        "_rounding": "0",
                        "_digits": "0"
                    },
                    "SYP": {
                        "_rounding": "0",
                        "_digits": "0"
                    },
                    "TMM": {
                        "_rounding": "0",
                        "_digits": "0"
                    },
                    "TND": {
                        "_rounding": "0",
                        "_digits": "3"
                    },
                    "TRL": {
                        "_rounding": "0",
                        "_digits": "0"
                    },
                    "TWD": {
                        "_rounding": "0",
                        "_digits": "2",
                        "_cashRounding": "0",
                        "_cashDigits": "0"
                    },
                    "TZS": {
                        "_rounding": "0",
                        "_digits": "0"
                    },
                    "UGX": {
                        "_rounding": "0",
                        "_digits": "0"
                    },
                    "UYI": {
                        "_rounding": "0",
                        "_digits": "0"
                    },
                    "UZS": {
                        "_rounding": "0",
                        "_digits": "0"
                    },
                    "VND": {
                        "_rounding": "0",
                        "_digits": "0"
                    },
                    "VUV": {
                        "_rounding": "0",
                        "_digits": "0"
                    },
                    "XAF": {
                        "_rounding": "0",
                        "_digits": "0"
                    },
                    "XOF": {
                        "_rounding": "0",
                        "_digits": "0"
                    },
                    "XPF": {
                        "_rounding": "0",
                        "_digits": "0"
                    },
                    "YER": {
                        "_rounding": "0",
                        "_digits": "0"
                    },
                    "ZMK": {
                        "_rounding": "0",
                        "_digits": "0"
                    },
                    "ZWD": {
                        "_rounding": "0",
                        "_digits": "0"
                    }
                }
            }
        }
    }
];

