/*
Copyright (c) 2003-2014, CKSource - Frederico Knabben. All rights reserved.
For licensing, see LICENSE.md or http://ckeditor.com/licensePortions Copyright IBM Corp., 2009-2015.
*/
CKEDITOR.plugins.setLang( 'clipboard', 'bg', {
	copy		: "Копиране",
	copyError	: "Настройките за безопасност на Вашия браузър предотвратяват автоматичното копиране. Вместо това използвайте Ctrl+C от Вашата клавиатура.",
	cut			: "Изрязване",
	cutError	: "Настройките за безопасност на Вашия браузър предотвратяват автоматичното изрязване. Вместо това използвайте Ctrl+X от Вашата клавиатура.",
	paste		: "Поставяне",
	pasteArea	: "Зона за поставяне",
	pasteMsg	: "Натиснете Ctrl+V (Cmd+V на MAC), за да поставите отдолу.",
	securityMsg	: "Защитата на Вашия браузър блокира директното поставяне от клипборда.",
	title		: "Поставяне",
	fakepath : "Поставянето на изображения понастоящем не се поддържа. Моля използвайте вместо това опция \'Вмъкване на изображение\' от лентата с инструменти."
});

